{
    "Ability Capsule": "Allows a Pokémon with two Abilities to switch between these Abilities.\n",
    "Ability Patch": "Allows a Pokémon to change its standard Ability to its Hidden Ability, or its Hidden Ability to its first Ability slot*.\n",
    "Ability Shield": "Prevents the holder's Ability from being changed by other Pokémon.\n",
    "Ability Urge": "Activates the Ability of an ally Pokémon. Wonder Launcher only.\n",
    "Abomasite": "Allows Abomasnow to Mega Evolve into Mega Abomasnow.\n",
    "Abra Candy": "Increase all stats of a member of the Abra family by one AV point.\n",
    "Absolite": "Allows Absol to Mega Evolve into Mega Absol.\n",
    "Absorb Bulb": "Raises the holder's Special Attack after being hit by a Water-type attack. Consumed after use.\n",
    "Academy Ball": "One of the balls the player and their Pokémon can play with during a picnic.\n",
    "Academy Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Academy Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Academy Cup": "One of the cups the player can use during a picnic.\n",
    "Academy Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Acro Bike": "A bicycle with which the player can do tricks such as jump sideways.\n",
    "Adamant Crystal": "Switches Dialga between its normal form and Origin Forme.\n",
    "Adamant Mint": "Changes a Pokémon's Nature to Adamant.\n",
    "Adamant Orb": "Boosts Dialga's Steel- and Dragon-type attacks.\n",
    "Adrenaline Orb": "When used, makes wild Pokémon more likely to call allies for help in an SOS Battle. Is not consumed if it fails. If the holder is affected by Intimidate, its Speed is increased by one stage.\n",
    "Adventure Guide": "Contains information new Trainers should know.\n",
    "Aerodactylite": "Allows Aerodactyl to Mega Evolve into Mega Aerodactyl.\n",
    "Aerodactyl Candy": "Increase all stats of a member of the Aerodactyl family by one AV point.\n",
    "Aggronite": "Allows Aggron to Mega Evolve into Mega Aggron.\n",
    "Aguav Berry": "When HP falls below 25%, restores 50% HP, but confuses Pokémon that dislike bitter food (12.5% when below 50% before Gen. VII).\n",
    "Air Balloon": "Gives the holder an immunity to Ground-type moves but is popped when the holder is hit by any non-Ground-type attacks.\n",
    "Air Mail": "A red- and blue-striped stationery. To be held by a Pokémon for delivery.\n",
    "Alakazite": "Allows Alakazam to Mega Evolve into Mega Alakazam.\n",
    "Aloraichium Z": "Allows Alolan Raichu to upgrade Thunderbolt to the special Z-Move Stoked Sparksurfer.\n",
    "Altarianite": "Allows Altaria to Mega Evolve into Mega Altaria.\n",
    "Amaze Mulch": "Combines the effects of Boost Mulch, Rich Mulch, and Surprise Mulch: Causes an applied Berry patch's soil to dry quicker, increases final Berry harvest by 2 Berries, and makes Berry mutations more likely.\n",
    "Ampharosite": "Allows Ampharos to Mega Evolve into Mega Ampharos.\n",
    "Amulet Coin": "Doubles the earned money after a battle against a Trainer.\n",
    "Antidote": "Heals the poisoning of a Pokémon.\n",
    "Apicot Berry": "Raises Special Defense when HP is below ⅓.\n",
    "Apple": "An ingredient for sandwiches.\n",
    "Apricorn": "Used to craft Poké Balls in Hisui.\n",
    "Apricorn Box": "Contains Apricorns.\n",
    "Aqua Suit": "Allows the player to ride Kyogre in the Cave of Origin and fly into space on Rayquaza.\n",
    "Armor Fossil": "A Fossil from which a Shieldon can be resurrected.\n",
    "Armor Pass": "Allows access to the Isle of Armor from Wedgehurst railway station.\n",
    "Armorite Ore": "A secondary form of currency in Galar to access extra content in the Isle of Armor.\n",
    "Articuno Candy": "Increase all stats of a member of the Articuno family by one AV point.\n",
    "Articuno Treat": "Allows the player to encounter Articuno in the Terarium.\n",
    "Aspear Berry": "Removes the frozen condition from a Pokémon.\n",
    "Assault Vest": "Raises Sp. Def but prevents the use of status moves.\n",
    "Audinite": "Allows Audino to Mega Evolve into Mega Audino.\n",
    "AuroraTicket": "Event item that allows player to catch Deoxys.\n",
    "Auspicious Armor": "Used to evolve Charcadet into Armarouge.\n",
    "Autograph": "Reward for defeating Lt. Surge.\n",
    "Aux Evasion": "Makes moves less likely to strike during battle.\n",
    "Aux Guard": "Raises a Pokémon's defensive stats during battle.\n",
    "Aux Power": "Raises a Pokémon's offensive stats during battle.\n",
    "Aux Powerguard": "Raises a Pokémon's offensive and defensive stats during battle.\n",
    "Avocado": "An ingredient for sandwiches.\n",
    "Awakening": "Awakens a sleeping Pokémon.\n",
    "Azelf's Fang": "One of the items used to obtain the Red Chain.\n",
    "Azure Flute": "Key Item used to access the Hall of Origin and face Arceus. Unobtainable before Generation VIII.\n",
    "B&W Grass Chairs": "One of the chair sets the player can use during a picnic.\n",
    "B&W Grass Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Babiri Berry": "Reduces damage from a super effective Steel-type move by 50%.\n",
    "Bach's Food Tin": "Ingredient for curry.\n",
    "Bacon": "An ingredient for sandwiches.\n",
    "Baguette": "An ingredient for sandwiches.\n",
    "Ball of Mud": "Used to stun Pokémon and craft Sticky Globs in Hisui.\n",
    "Balm Mushroom": "Can be sold for $25000.Note: Formatted as BalmMushroom in Generation V.\n",
    "Band Autograph": "Unobtainable during normal gameplay.\n",
    "Banana": "An ingredient for sandwiches.\n",
    "Banettite": "Allows Banette to Mega Evolve into Mega Banette.\n",
    "Barred Cup": "One of the cups the player can use during a picnic.\n",
    "Basculegion Food": "Used to befriend the rideable Basculegion.\n",
    "Basement Key": "Allows the player to access New Mauville.\n",
    "Basil": "An ingredient for sandwiches.\n",
    "Battle Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Battle Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Beach Glass": "Can be sold for $400.\n",
    "Bead Mail": "A bead-printed stationery. To be held by a Pokémon for delivery.\n",
    "Bean Cake": "Used to attract certain Pokémon.\n",
    "Beast Ball": "Allows the player to catch wild Pokémon; works better on Ultra Beasts.\n",
    "Beedrillite": "Allows Beedrill to Mega Evolve into Mega Beedrill.\n",
    "Bellsprout Candy": "Increase all stats of a member of the Bellsprout family by one AV point.\n",
    "Belue Berry": "Poffin and Pokéblock ingredient.\n",
    "Berry": "Restores 10 HP. A Pokémon can use it automatically if it is holding it.\n",
    "Berry Juice": "Restores 20 HP.\n",
    "Berry Pots": "Allows Berry growth while traveling.\n",
    "Berry Pouch": "Holds Berries.\n",
    "Berry Sweet": "When Milcery evolves holding this the Alcremie will have the Berry Sweet decoration.\n",
    "Berserk Gene": "Confuses the holder and raises Attack.\n",
    "Bicycle": "Can be used to travel quickly. Cannot be ridden in swamps, or in very tall grass. Known as Bike in Generation IV onwards.\n",
    "Big Bamboo Shoot": "Can be sold for $1,500.\n",
    "Big Malasada": "Used to heal poison, paralysis, sleep, burn, freeze, and confusion.\n",
    "Big Mushroom": "Can be sold for $2500.\n",
    "Big Nugget": "Can be sold for $30000.\n",
    "Big Pearl": "Can be sold for $3750.\n",
    "Big Root": "Increases the amount of HP restored when an HP-draining move is used by 30%.\n",
    "Bike Voucher": "Used to pay for a Bicycle.\n",
    "Binding Band": "Increases the end of turn damage of binding moves from 1/16 to ⅛ of the target's maximum HP.\n",
    "Bitter Berry": "Heals confusion.\n",
    "Bitter Herba Mystica": "An ingredient for sandwiches.\n",
    "Black Apricorn": "If taken to Kurt, he will make the player a Fast Ball. Also, Apricorn Drink ingredient.Note: Formatted as Blk Apricorn prior to Generation VI.\n",
    "Black Augurite": "Used to evolve Scyther into Kleavor.\n",
    "Black Belt": "Raises the power of Fighting-type moves.Note: Formatted as Blackbelt in Generation II.\n",
    "Black Flute": "Repels wild Pokémon.RSEFRLGDPPtHGSS Can be sold for $8000.BWB2W2 Increases the level of wild Pokémon by one to three levels.ORAS\n",
    "Black Glasses": "Raises the power of Dark-type moves.Note: Formatted as BlackGlasses prior to Generation VI.\n",
    "Black Mane Hair": "Used with a Radiant Petal to create the Reins of Unity.\n",
    "Black Sludge": "Restores 1/16 of the Pokémon's maximum HP each turn when held by Poison-type Pokémon; damages all other types by ⅛ of maximum HP each turn.\n",
    "Black Tumblestone": "Used to craft Heavy, Leaden, and Gigaton Balls in Hisui.\n",
    "Blank Plate": "Changes Arceus and the move Judgment to Normal-type.\n",
    "Blastoisinite": "Allows Blastoise to Mega Evolve into Mega Blastoise.\n",
    "Blazikenite": "Allows Blaziken to Mega Evolve into Mega Blaziken.\n",
    "Bloom Mail": "A flower-printed stationery. To be held by a Pokémon for delivery.\n",
    "Blue Apricorn": "If taken to Kurt, he will make the player a Lure Ball. Also, Apricorn Drink ingredient.Note: Formatted as Blu Apricorn prior to Generation VI.\n",
    "Blueberry Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Blueberry Tablecloth": "One of the tablecloth sets the player can use during a picnic.\n",
    "Blue Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Blue Card": "Allows player to answer daily question on Buena's show to get points exchangeable for items.\n",
    "Blue Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Blue Cup": "One of the cups the player can use during a picnic.\n",
    "Blue Dish": "One of the dishes the player can use to make a sandwich on.\n",
    "Blue-Flag Pick": "One of the picks the player can use to make a sandwich.\n",
    "Blue Flute": "Awakens sleeping Pokémon when used, can be used an unlimited number of times. May be used in battle or in the field.RSEFRLGColoXDDPPtHGSSORAS Can be sold for $7000.BWB2W2\n",
    "Blue Orb": "Used to awaken Kyogre. It also turns Kyogre into Primal Kyogre during battle when holding the item.ORAS\n",
    "Blue Petal": "A blue petal required to complete Mina's Trial.\n",
    "Blue Poké Ball Pick": "One of the picks the player can use to make a sandwich.\n",
    "Blue Scarf": "Raises the Beautiful condition.\n",
    "Blue Shard": "Exchangeable for a variety of services.\n",
    "Blue-Sky Flower Pick": "One of the picks the player can use to make a sandwich.\n",
    "Bluesky Mail": "A sky-print mail. To be held by a Pokémon for delivery.\n",
    "Blue Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Blu ID Badge": "One of four keys needed to unlock the north door of Realgam Tower.\n",
    "Bluk Berry": "Poffin and Pokéblock ingredient.\n",
    "Blunder Policy": "If a move misses due to Accuracy, the user's Speed is increased.\n",
    "Bob's Food Tin": "Ingredient for curry.\n",
    "Boiled Egg": "Ingredient for curry.\n",
    "Bold Mint": "Changes a Pokémon's Nature to Bold.\n",
    "Bonsly Card": "Allows play of the card in Battle Bingo.\n",
    "Bonsly Photo": "The Battle Bingo prize for winning/using the Bonsly Card.\n",
    "Boost Mulch": "When applied to a Berry patch, causes the soil to dry out in 4 hours.\n",
    "Booster Energy": "Activates Protosynthesis when harsh sunlight is not active, or Quark Drive when Electric Terrain is not active.\n",
    "Bottle Cap": "Can be traded to Mr. Hyper to maximize one of a Pokémon's IVs in Hyper Training.\n",
    "Brave Mint": "Changes a Pokémon's Nature to Brave.\n",
    "Bread": "Ingredient for curry.\n",
    "Briar's Book": "Can be given to Professor SadaS or TuroV, in exchange for their copy of the Scarlet BookS/Violet BookV.\n",
    "Brick Mail": "A brick pattern stationery. To be held by a Pokémon for delivery.\n",
    "Brick Piece": "Can be sold for $50.\n",
    "Bridge Mail D": "Stationary with a red drawbridge print. To be held by a Pokémon for delivery.Note: Formatted as BridgeMail D prior to Generation VI.\n",
    "Bridge Mail M": "Stationary with an arched bridge print. To be held by a Pokémon for delivery.Note: Formatted as BridgeMail M prior to Generation VI.\n",
    "Bridge Mail S": "Stationary with a sky-piercing bridge print. To be held by a Pokémon for delivery.Note: Formatted as BridgeMail S prior to Generation VI.\n",
    "Bridge Mail T": "Stationary with a steel suspension bridge print. To be held by a Pokémon for delivery.Note: Formatted as BridgeMail T prior to Generation VI.\n",
    "Bridge Mail V": "Stationary with a brick bridge print. To be held by a Pokémon for delivery.Note: Formatted as BridgeMail V prior to Generation VI.\n",
    "Bright Powder": "Lowers the opponent's accuracy.Note: Formatted as BrightPowder prior to Generation VI.\n",
    "Brittle Bones": "Ingredient for curry.\n",
    "Bronze Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Bronze Cup": "One of the cups the player can use during a picnic.\n",
    "Bubble Mail": "Stationery with a bubble print. To be held by a Pokémon for delivery.\n",
    "Bug Gem": "Increases the power of the holder's first Bug-type move by 50%, and is consumed after use.\n",
    "Bug Memory": "Makes Silvally a Bug-type Pokémon and makes Multi-Attack a Bug-type move.\n",
    "Bug Tera Shard": "Used to change the Tera Type of a Pokémon to Bug type.\n",
    "Buginium Z": "Allows a Pokémon to upgrade their Bug-type damaging moves to the Z-Move Savage Spin-Out or upgrade their Bug-type status moves into Z-Moves. Makes Arceus a Bug-type Pokémon.\n",
    "Bugwort": "Used to craft items in Hisui.\n",
    "Bulbasaur Candy": "Increase all stats of a member of the Bulbasaur family by one AV point.\n",
    "Burn Drive": "Makes Techno Blast a Fire-type move when held by Genesect.\n",
    "Burn Heal": "Heals a burn.\n",
    "Burnt Berry": "Thaws out a frozen Pokémon.\n",
    "Butter": "An ingredient for sandwiches.\n",
    "Cake-Lure Base": "Used to craft cake items in Hisui.\n",
    "Calcium": "Raises the Special Attack of a Pokémon.\n",
    "Calm Mint": "Changes a Pokémon's Nature to Calm.\n",
    "Cameruptite": "Allows Camerupt to Mega Evolve into Mega Camerupt.\n",
    "Camping Gear": "Allows the player to set up a Pokémon Camp.\n",
    "Candy Truffle": "Used to craft Aux Evasion, Dire Hits and Swap Snacks in Hisui.\n",
    "Carbos": "Raises the Speed of a Pokémon.\n",
    "Card Key": "Allows the player to access the east wing of the Shadow PKMN Lab.\n",
    "Careful Mint": "Changes a Pokémon's Nature to Careful.\n",
    "Carrot Seeds": "Can be planted by the player to obtain the Iceroot Carrot or the Shaderoot Carrot.\n",
    "Casteliacone": "Cures any status condition.\n",
    "Caster Fern": "Used for crafting items in Hisui.\n",
    "Catching Charm": "Increases the chance of a critical catch.\n",
    "Caterpie Candy": "Increase all stats of a member of the Caterpie family by one AV point.\n",
    "Celestica Flute": "Summons rideable Pokémon in Hisui.\n",
    "Cell Battery": "Raises the holder's Attack one stage when hit with an Electric-type attack. Consumed after use.\n",
    "Chalky Stone": "Can be sold for $30.\n",
    "Chansey Candy": "Increase all stats of a member of the Chansey family by one AV point.\n",
    "Charcoal": "Raises the power of Fire-type moves.\n",
    "Charizardite X": "Allows Charizard to Mega Evolve into Mega Charizard X.\n",
    "Charizardite Y": "Allows Charizard to Mega Evolve into Mega Charizard Y.\n",
    "Charmander Candy": "Increase all stats of a member of the Charmander family by one AV point.\n",
    "Charti Berry": "Reduces damage from a super effective Rock-type move by 50%.\n",
    "Cheese": "An ingredient for sandwiches.\n",
    "Cheri Berry": "Heals paralysis.\n",
    "Cherish Ball": "A special type of Poké Ball in which event Pokémon are usually distributed.\n",
    "Cherry Tomatoes": "An ingredient for sandwiches.\n",
    "Chesto Berry": "Awakens a Pokémon from sleep.\n",
    "Chilan Berry": "Reduces damage from a Normal-type move by 50%.\n",
    "Chili Sauce": "An ingredient for sandwiches.\n",
    "Chill Drive": "Makes Techno Blast an Ice-type move when held by Genesect.\n",
    "Chipped Pot": "Causes an Antique Form Sinistea to evolve into Polteageist.\n",
    "Choice Band": "Raises user's Attack, but they can only use one move.\n",
    "Choice Dumpling": "Can be used to make a Pokémon fixated on one move while raising the damage dealt from that move and damage taken from others.\n",
    "Choice Scarf": "Raises user's Speed, but they can only use one move.\n",
    "Choice Specs": "Raises user's Special Attack, but they can only use one move.\n",
    "Chople Berry": "Reduces damage from a super effective Fighting-type move by 50%.\n",
    "Chorizo": "An ingredient for sandwiches.\n",
    "Claw Fossil": "A Fossil from which an Anorith can be resurrected.\n",
    "Cleanse Tag": "Repels Pokémon if the holder is first in the party.\n",
    "Clear Amulet": "Prevents the holder from having its stats lowered by moves or Abilities.\n",
    "Clear Bell": "Summons SuicuneC or Ho-OhHGOR.\n",
    "Clefairy Candy": "Increase all stats of a member of the Clefairy family by one AV point.\n",
    "Clever Feather": "Raises the Special Defense of a Pokémon.Note: Known as Clever Wing prior to Generation VIII.\n",
    "Clever Mochi": "Increases a Pokémon's Sp. Def EVs by 10.\n",
    "Clover Sweet": "When Milcery evolves holding this the Alcremie will have the Clover Sweet decoration.\n",
    "Coba Berry": "Reduces damage from a super effective Flying-type move by 50%.\n",
    "Cobalion Treat": "Allows the player to encounter Cobalion in the Terarium.\n",
    "Coconut Milk": "Ingredient for curry.\n",
    "Coin Case": "A Key Item that stores the coins collected at the local Game Corner.\n",
    "Colbur Berry": "Reduces damage from a super effective Dark-type move by 50%.\n",
    "Cologne Case": "Holds Scents.\n",
    "Colress Machine": "A special device that wrings out the potential of Pokémon. It is an imperfect prototype.Note: Formatted as Colress MCHN prior to Generation VI.\n",
    "Comet Shard": "Can be sold for $60000.\n",
    "Common Stone": "Not available without cheating. Currently has no use.\n",
    "Contest Costume": "Worn during Pokémon Contest Spectacular performances.\n",
    "Contest Pass": "Allows the player to enter Contests.\n",
    "Cornerstone Mask": "Changes Ogerpon into its Cornerstone Mask form when held. It increases the power of its moves by 20%.\n",
    "Cornn Berry": "Poffin and Pokéblock ingredient.\n",
    "Coupon 1": "Used to obtain the Pokétch in Jubilife City.\n",
    "Coupon 2": "Used to obtain the Pokétch in Jubilife City.\n",
    "Coupon 3": "Used to obtain the Pokétch in Jubilife City.\n",
    "Courage Candy": "Increase a Pokémon's Special Defense by 1 AV until it has reached 50 AV's in the stat.\n",
    "Courage Candy L": "Increase a level 30+ Pokémon's Special Defense by 1 AV until it has reached 100 AV's in the stat.\n",
    "Courage Candy XL": "Increase a level 60+ Pokémon's Special Defense by 1 AV until it has reached 200 AV's in the stat.\n",
    "Cover Fossil": "A Fossil from which a Tirtouga can be resurrected.\n",
    "Covert Cloak": "Protects the holder from the additional effects of another Pokémon's damaging moves.\n",
    "Cracked Pot": "Causes a Phony Form Sinistea to evolve into Polteageist.\n",
    "Crafting Kit": "Allows the player to craft items in the field.\n",
    "Cream Cheese": "An ingredient for sandwiches.\n",
    "Crown Pass": "Allows access to the Crown Tundra from Wedgehurst railway station.\n",
    "Crunchy Salt": "Used to craft Salt Cakes in Hisui and bait certain Pokémon.\n",
    "Crystal Cluster": "Used to repair Ogerpon's Teal Mask.\n",
    "Cubone Candy": "Increase all stats of a member of the Cubone family by one AV point.\n",
    "Cry Analyzer": "Detaches certain translators.\n",
    "Cucumber": "An ingredient for sandwiches.\n",
    "Curry Powder": "An ingredient for sandwiches.\n",
    "Custap Berry": "Allows holder to move first just once when HP is below ⅓.\n",
    "Cyber Ball": "One of the balls the player and their Pokémon can play with during a picnic.\n",
    "Damp Mulch": "Causes the soil to dry out more slowly, but also causes the Berry plant to grow more slowly.\n",
    "Damp Rock": "Increases the duration of heavy rain.\n",
    "Dark Gem": "Increases the power of the holder's first Dark-type move by 50%, and is consumed after use.\n",
    "Dark Memory": "Makes Silvally a Dark-type Pokémon and makes Multi-Attack a Dark-type move.\n",
    "Dark Stone": "Stone used to summon Zekrom.\n",
    "Dark Tera Shard": "Used to change the Tera Type of a Pokémon to Dark type.\n",
    "Darkinium Z": "Allows a Pokémon to upgrade their Dark-type damaging moves to the Z-Move Black Hole Eclipse or upgrade their Dark-type status moves into Z-Moves. Makes Arceus a Dark-type Pokémon.\n",
    "Data Cards": "Record various Pokéathlon records, allowing the player to access records from a computer in the Pokéathlon Dome.\n",
    "Data ROM": "Holds data on Shadow Pokémon.\n",
    "Dawn Stone": "Allows Kirlia (♂) and Snorunt (♀) to evolve.\n",
    "Dazzling Honey": "Used to craft Honey Cakes in Hisui and bait certain Pokémon.\n",
    "D-Disk": "Moves the UFO in The Under downward into Deep Colosseum.\n",
    "Decidium Z": "Allows Decidueye to upgrade Spirit Shackle to the special Z-Move Sinister Arrow Raid.\n",
    "Deep Sea Scale": "A hold item that allows Clamperl to evolve into Gorebyss when traded.Note: Formatted as DeepSeaScale prior to Generation VI.\n",
    "Deep Sea Tooth": "A hold item that allows Clamperl to evolve into Huntail when traded.Note: Formatted as DeepSeaTooth prior to Generation VI.\n",
    "Destiny Knot": "Infatuates the foe if the holder becomes infatuated.\n",
    "Devon Parts": "To be delivered to Captain Stern.Note: Called Devon Goods in Generation III.\n",
    "Devon Scope": "Reveals hidden Pokémon.\n",
    "Devon Scuba Gear": "Worn while underwater.\n",
    "Diamond Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Diamond Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Diamond Pattern Cup": "One of the cups the player can use during a picnic.\n",
    "Diamond Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Diancite": "Allows Diancie to Mega Evolve into Mega Diancie.\n",
    "Digger Drill": "Used to create a Secret Base in the Grand Underground.\n",
    "Diglett Candy": "Increase all stats of a member of the Diglett family by one AV point.\n",
    "Dire Hit": "Raises critical hit ratio in battle. Only craftable in Hisui.\n",
    "Dire Hit 2": "Raises critical hit ratio by 2 levels in battle. Wonder Launcher only.\n",
    "Dire Hit 3": "Raises critical hit ratio by 3 levels in battle. Wonder Launcher only.\n",
    "Direshroom": "Used to craft Dire Hits and Choice Dumplings in Hisui.\n",
    "Disc Case": "Holds Battle CDs.\n",
    "Discount Coupon": "Used at any boutique for a one-time 50% discount.\n",
    "Discovery Slate": "Allows the player to fight the legendary giants in the Discovery Room.\n",
    "Distortion Slate": "Allows the player to fight Origin Forme Giratina in the Distortion Room.\n",
    "Ditto Candy": "Increase all stats of a member of the Ditto family by one AV point.\n",
    "Dive Ball": "A type of Poké Ball that works better on Pokémon encountered underwaterRSEORAS or while Surfing or fishingFRLGDPPtHGSSBWB2W2XY.\n",
    "DNA Sample": "Used to deduce the code to a lock in the Shadow PKMN Lab.\n",
    "DNA Splicers": "Combines and separates Kyurem with Reshiram or Zekrom, transforming them into White Kyurem or Black Kyurem, respectively.\n",
    "Doduo Candy": "Increase all stats of a member of the Doduo family by one AV point.\n",
    "Dome Fossil": "A Fossil from which a Kabuto can be resurrected.\n",
    "Doppel Bonnets": "Used to craft Aux Evasion in Hisui.\n",
    "Douse Drive": "Makes Techno Blast a Water-type move when held by Genesect.\n",
    "Down St. Key": "Allows the player to access the basement floor of the Shadow PKMN Lab.\n",
    "Dowsing Machine": "A Key Item that can be used to detect hidden items.Note: Referred to as the Itemfinder prior to Generation IV and as the Dowsing MCHN in Pokémon HeartGold and SoulSilver and the Generation V games.\n",
    "Draco Plate": "Raises the power of Dragon-type moves. Changes the move Judgment to Dragon-type.\n",
    "Dragon Fang": "Raises the power of Dragon-type moves.\n",
    "Dragon Gem": "Increases the power of the holder's first Dragon-type move by 50%, and is consumed after use.\n",
    "Dragon Memory": "Makes Silvally a Dragon-type Pokémon and makes Multi-Attack a Dragon-type move.\n",
    "Dragon Scale": "A hold item that allows Seadra to evolve when traded.\n",
    "Dragon Skull": "Stolen from the Nacrene Museum by a Team Plasma Grunt.\n",
    "Dragon Tera Shard": "Used to change the Tera Type of a Pokémon to Dragon type.\n",
    "Dragonium Z": "Allows a Pokémon to upgrade their Dragon-type damaging moves to the Z-Move Devastating Drake or upgrade their Dragon-type status moves into Z-Moves. Makes Arceus a Dragon-type Pokémon.\n",
    "Drash Berry": "Cures Poison status. Will turn into an Enigma Berry if transferred to Generation IV via Pal Park.\n",
    "Dratini Candy": "Increase all stats of a member of the Dratini family by one AV point.\n",
    "Dread Plate": "Raises the power of Dark-type moves. Changes the move Judgment to Dark-type.\n",
    "Dream Ball": "Used to catch Pokémon in Entralink.\n",
    "Dream Mail": "To be held by a Pokémon for delivery.\n",
    "Dropped Item": "The Xtransceiver found at the Nimbasa City amusement park. It seems it belongs to a boy/girl.\n",
    "Drowzee Candy": "Increase all stats of a member of the Drowzee family by one AV point.\n",
    "DS Sounds": "Changes the music that plays in-game to match the soundtrack of the original Pokémon Diamond and Pearl.\n",
    "Dubious Disc": "A hold item that allows Porygon2 to evolve when traded.\n",
    "Durin Berry": "Poffin and Pokéblock ingredient.\n",
    "Dusk Ball": "A type of Poké Ball that works especially well in dark places such as caves or at night.\n",
    "Dusk Stone": "Can be used to evolve Misdreavus, Murkrow, Lampent, and Doublade.\n",
    "Dynamax Band": "Allows the player to Dynamax their Pokémon.\n",
    "Dynamax Candy": "Increases the Dynamax level of a Pokémon.\n",
    "Dynamax Crystals": "When used at the Watchtower Lair, a Pokémon Den at the base of the Watchtower Ruins in the Wild Area, the den will become active with a Dynamax Pokémon based on the crystal used.\n",
    "Dynite Ore": "A secondary form of currency in Galar to access extra content in the Crown Tundra.\n",
    "Earth Plate": "Raises the power of Ground-type moves. Changes the move Judgment to Ground-type.\n",
    "Eevee Candy": "Increase all stats of a member of the Eevee family by one AV point.\n",
    "Eevee Cup": "One of the cups the player can use during a picnic.\n",
    "Eevium Z": "Allows Eevee to upgrade Last Resort to the special Z-Move Extreme Evoboost.\n",
    "Egg": "An ingredient for sandwiches.\n",
    "Egg Ticket": "Can be exchanged for the Odd Egg.\n",
    "Eggant Berry": "Cures infatuation status. Will turn into an Enigma Berry if transferred to Generation IV via Pal Park.\n",
    "Ein File C": "Describes Celebi.\n",
    "Ein File F": "Describes additional details on purification.\n",
    "Ein File H": "Describes Hyper Mode.\n",
    "Ein File P": "Describes purification.\n",
    "Ein File S": "Describes Shadow Pokémon.\n",
    "Eject Button": "Forces the holder to switch out when hit by an attack that makes contact. Consumed after use.\n",
    "Eject Pack": "Forces the holder to switch out when their stats are lowered. Consumed after use.\n",
    "Ekans Candy": "Increase all stats of a member of the Ekans family by one AV point.\n",
    "Electabuzz Candy": "Increase all stats of a member of the Electabuzz family by one AV point.\n",
    "Electirizer": "A hold item that allows Electabuzz to evolve when traded.\n",
    "Electric Gem": "Increases the power of the holder's first Electric-type move by 50%, and is consumed after use.\n",
    "Electric Memory": "Makes Silvally a Electric-type Pokémon and makes Multi-Attack an Electric-type move.\n",
    "Electric Seed": "A one-time use item that raises the holder's Defense by one stage upon activation of Electric Terrain.\n",
    "Electric Tera Shard": "Used to change the Tera Type of a Pokémon to Electric type.\n",
    "Electrium Z": "Allows a Pokémon to upgrade their Electric-type damaging moves to the Z-Move Gigavolt Havoc or upgrade their Electric-type status moves into Z-Moves. Makes Arceus an Electric-type Pokémon.\n",
    "Elevator Key": "Activates the elevator in Lysandre Labs.\n",
    "Elixir": "Restores 10 PP of each move of a Pokémon.\n",
    "Endorsement": "Allows the player to participate in the Gym Challenge.\n",
    "Energy Powder": "Restores 50 HP, but lowers friendship.Note: Formatted as EnergyPowder prior to Generation VI.\n",
    "Energy Root": "Restores 200 HP, but lowers friendship.\n",
    "Enigma Berry": "Restores ¼ of a Pokémon's HP after being hit by a super effective.\n",
    "Enigma Stone": "Allows for the capture of either Latias or Latios.\n",
    "Enigmatic Card": "Allows the player to enter Looker and Anabel's motel room on Route 8.\n",
    "Entei Treat": "Allows the player to encounter Entei in the Terarium.\n",
    "Eon Flute": "Summons LatiasAS or LatiosOR to soar in the sky above Hoenn, and fly to any city, route, or island.\n",
    "Eon Mail": "Eevee-printed mail. To be held by a Pokémon for delivery.\n",
    "Eon Ticket": "Allows player to access Southern Island.\n",
    "Escape Rope": "Teleports the player out of a cave or dungeon if the player cannot find the way out.\n",
    "Eternal Ice": "Used to create Snow Balms.\n",
    "Ether": "Restores 10 PP of one move of a Pokémon.\n",
    "Everstone": "A hold item that prevents the holder from evolving.\n",
    "Eviolite": "Raises the holder's Defense and Special Defense by 50% if the holder is capable of evolving.\n",
    "Exercise Ball": "One of the balls the player and their Pokémon can play with during a picnic.\n",
    "Excite Scent": "Reduces heart gauge, increases friendship.\n",
    "Exeggcute Candy": "Increase all stats of a member of the Exeggcute family by one AV point.\n",
    "Exp. Candy L": "Increases a Pokémon's experience by 10,000 Exp. Points.\n",
    "Exp. Candy M": "Increases a Pokémon's experience by 3,000 Exp. Points.\n",
    "Exp. Candy S": "Increases a Pokémon's experience by 800 Exp. Points.\n",
    "Exp. Candy XL": "Increases a Pokémon's experience by 30,000 Exp. Points.\n",
    "Exp. Candy XS": "Increases a Pokémon's experience by 100 Exp. Points.\n",
    "Exp. Charm": "Increases the amount of experience the player's party receives by 50%.\n",
    "Exp. Share": "A held item that allows Pokémon to gain experience without battling.Note: Named Exp.All prior to Generation II.\n",
    "Expert Belt": "Increases the power of super effective moves.\n",
    "Explorer Kit": "A Key Item which can be used to go to Sinnoh Underground.\n",
    "Fab Mail": "Mail with an extremely decorative design. To be held by a Pokémon for delivery.\n",
    "Fairium Z": "Allows a Pokémon to upgrade their Fairy-type damaging moves to the Z-Move Twinkle Tackle or upgrade their Fairy-type status moves into Z-Moves. Makes Arceus a Fairy-type Pokémon.\n",
    "Fairy Feather": "Boosts the power of the holder's Fairy-type moves.\n",
    "Fairy Gem": "Increases the power of the holder's first Fairy-type move by 50%, and is consumed after use.\n",
    "Fairy Memory": "Makes Silvally a Fairy-type Pokémon and makes Multi-Attack a Fairy-type move.\n",
    "Fairy Tera Shard": "Used to change the Tera Type of a Pokémon to Fairy type.\n",
    "Fame Checker": "Records information on famous people, such as Gym Leaders.\n",
    "Fancy Apple": "Ingredient for curry.\n",
    "Farfetch'd Candy": "Increase all stats of a member of the Farfetch'd family by one AV point.\n",
    "Fashion Case": "Stores Accessories.\n",
    "Fast Ball": "A type of Poké Ball that works better on Pokémon that try to flee.\n",
    "Favored Mail": "Stationary designed for writing about your favorite things. To be held by a Pokémon for delivery.\n",
    "F-Disk": "Moves the UFO in The Under to the Under Colosseum.\n",
    "Feather Ball": "A type of Poké Ball that catches flying and farther away Pokémon more easily.\n",
    "Festival Ticket": "A ticket that allows you to host a mission in Festival Plaza.\n",
    "Fiery Pick": "One of the picks the player can use to make a sandwich.\n",
    "Fighting Gem": "Increases the power of the holder's first Fighting-type move by 50%, and is consumed after use.\n",
    "Fighting Memory": "Makes Silvally a Fighting-type Pokémon and makes Multi-Attack a Fighting-type move.\n",
    "Fighting Tera Shard": "Used to change the Tera Type of a Pokémon to Fighting type.\n",
    "Fightinium Z": "Allows a Pokémon to upgrade their Fighting-type damaging moves to the Z-Move All-Out Pummeling or upgrade their Fighting-type status moves into Z-Moves. Makes Arceus a Fighting-type Pokémon.\n",
    "Figy Berry": "When HP falls below 25%, restores 50% HP, but confuses Pokémon that dislike spicy food (12.5% when below 50% before Gen. VII).\n",
    "Fine Remedy": "Heals a Pokémon by 100 HP, but lowers it friendship.\n",
    "Fire Gem": "Increases the power of the holder's first Fire-type move by 50%, and is consumed after use.\n",
    "Fire Memory": "Makes Silvally a Fire-type Pokémon and makes Multi-Attack a Fire-type move.\n",
    "Fire Pattern Cup": "One of the cups the player can use during a picnic.\n",
    "Fire Stone": "Can be used to evolve Vulpix, Growlithe, Eevee, and Pansear.\n",
    "Fire Tera Shard": "Used to change the Tera Type of a Pokémon to Fire type.\n",
    "Firium Z": "Allows a Pokémon to upgrade their Fire-type damaging moves to the Z-Move Inferno Overdrive or upgrade their Fire-type status moves into Z-Moves. Makes Arceus a Fire-type Pokémon.\n",
    "Fishing Rod": "Allows the player to fish near underwater piles of rock.\n",
    "Fist Plate": "Raises the power of Fighting-type moves. Changes the move Judgment to Fighting-type.\n",
    "Flame Mail": "Mail with a fire design. To be held by a Pokémon for delivery.\n",
    "Flame Orb": "Inflicts a burn on the holder.\n",
    "Flame Plate": "Raises the power of Fire-type moves. Changes the move Judgment to Fire-type.\n",
    "Float Stone": "Halves the weight of the holder.\n",
    "Flower Mail": "Mail with a flower pattern. To be held by a Pokémon for delivery.\n",
    "Flower Pattern Cup": "One of the cups the player can use during a picnic.\n",
    "Flower Sweet": "When Milcery evolves holding this the Alcremie will have the Flower Sweet decoration.\n",
    "Fluffy Tail": "Allows the player to flee from any wild Pokémon battle.\n",
    "Flying Gem": "Increases the power of the holder's first Flying-type move by 50%, and is consumed after use.\n",
    "Flying Memory": "Makes Silvally a Flying-type Pokémon and makes Multi-Attack a Flying-type move.\n",
    "Flying Tera Shard": "Used to change the Tera Type of a Pokémon to Flying type.\n",
    "Flyinium Z": "Allows a Pokémon to upgrade their Flying-type damaging moves to the Z-Move Supersonic Skystrike or upgrade their Flying-type status moves into Z-Moves. Makes Arceus a Flying-type Pokémon.\n",
    "Focus Band": "May leave the holder with 1 HP when a move would normally cause them to faint.\n",
    "Focus Sash": "Prevents a one-hit knockout.\n",
    "Forage Bag": "Holds ingredients found during Mallow's trial.\n",
    "Forest Balm": "Can be used to calm frenzied Kleavor.\n",
    "Fossilized Bird": "A component Fossil of the Fossil Pokémon in Galar.\n",
    "Fossilized Dino": "A component Fossil of the Fossil Pokémon in Galar.\n",
    "Fossilized Drake": "A component Fossil of the Fossil Pokémon in Galar.\n",
    "Fossilized Fish": "A component Fossil of the Fossil Pokémon in Galar.\n",
    "Fresh-Start Mochi": "Resets all of a Pokémon's base points to zero.\n",
    "Fresh Cream": "Ingredient for curry.\n",
    "Fresh Water": "Restores 30 HP. (50HP before Gen. VII).\n",
    "Fried Fillet": "An ingredient for sandwiches.\n",
    "Fried Food": "Ingredient for curry.\n",
    "Friend Ball": "A type of Poké Ball that causes the Pokémon to become friendly.\n",
    "Fruit Bunch": "Ingredient for curry.\n",
    "Full Heal": "Cures any status condition.\n",
    "Full Incense": "Causes holder to move slower than the opponent. A Snorlax holding it can breed to produce Munchlax.\n",
    "Full Restore": "Fully restores all HP and cures all status problems of a Pokémon.\n",
    "Galactic Key": "Allows player to access the Galactic HQ in Veilstone City.\n",
    "Galarica Cuff": "Allows Galarian Slowpoke to evolve into Galarian Slowbro.\n",
    "Galarica Twig": "Can be exchanged to NPC's for Galarian Slowpoke's evolution items.\n",
    "Galarica Wreath": "Allows Galarian Slowpoke to evolve into Galarian Slowking.\n",
    "Galladite": "Allows Gallade to Mega Evolve into Mega Gallade.\n",
    "Ganlon Berry": "Raises Defense if HP is below ⅓ of maximum.\n",
    "Garchompite": "Allows Garchomp to Mega Evolve into Mega Garchomp.\n",
    "Gardevoirite": "Allows Gardevoir to Mega Evolve into Mega Gardevoir.\n",
    "Gastly Candy": "Increase all stats of a member of the Gastly family by one AV point.\n",
    "GB Sounds": "Allows player to listen to 8-bit background music in Johto.\n",
    "Gear": "Keeps the Pyrite Town generators going.\n",
    "Gengarite": "Allows Gengar to Mega Evolve into Mega Gengar.\n",
    "Genius Feather": "Raises the Special Attack of a Pokémon.Note: Known as Genius Wing prior to Generation VIII.\n",
    "Genius Mochi": "Increases a Pokémon's Sp. Atk EVs by 10.\n",
    "Genome Slate": "Allows the player to fight Mewtwo in the Genome Room.\n",
    "Gentle Mint": "Changes a Pokémon's Nature to Gentle.\n",
    "Geodude Candy": "Increase all stats of a member of the Geodude family by one AV point.\n",
    "Ghost Gem": "Increases the power of the holder's first Ghost-type move by 50%, and is consumed after use.\n",
    "Ghost Memory": "Makes Silvally a Ghost-type Pokémon and makes Multi-Attack a Ghost-type move.\n",
    "Ghost Tera Shard": "Used to change the Tera Type of a Pokémon to Ghost type.\n",
    "Ghostium Z": "Allows a Pokémon to upgrade their Ghost-type damaging moves to the Z-Move Never-Ending Nightmare or upgrade their Ghost-type status moves into Z-Moves. Makes Arceus a Ghost-type Pokémon.\n",
    "Gigantamix": "Ingredient for curry.\n",
    "Gigaton Ball": "A type of Poké Ball that falls at a very short distance, but catches Pokémon who have not notices the player at an even higher rate.\n",
    "Ginema Berry": "Raises a lowered stat in battle. If transferred to Generation IV via Pal Park, it will turn into an Enigma Berry.\n",
    "Glalitite": "Allows Glalie to Mega Evolve into Mega Glalie.\n",
    "Glastrier Treat": "Allows the player to encounter Glastrier in the Terarium.\n",
    "Glimmering Charm": "Increases the amount of Tera Shards received from Tera Raid Battles.\n",
    "Glitter Mail": "Mail with a Pikachu pattern.\n",
    "Go-Goggles": "A Key Item that allows the player to travel in sandstorm conditions. Unnecessary in Generations IV and V, as the player may enter sandstorm conditions without protection.\n",
    "God Stone": "Not available without cheating. Currently has no use.\n",
    "Gold Berry": "Restores 30 HP.\n",
    "Gold Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Gold Bottle Cap": "Can be traded to Mr. Hyper to maximize all of a Pokémon's IVs in Hyper Training.\n",
    "Gold Cup": "One of the cups the player can use during a picnic.\n",
    "Gold Leaf": "Can be sold for $1000GSC/$500PE.\n",
    "Gold Pick": "One of the picks the player can use to make a sandwich.\n",
    "Gold Teeth": "Safari Zone Warden's false teeth. Return for HM04 (Strength)\n",
    "Goldeen Candy": "Increase all stats of a member of the Goldeen family by one AV point.\n",
    "Gonzap's Key": "Opens an item box containing TM30 (Shadow Ball).\n",
    "Golden Nanab Berry": "Makes a wild Pokémon less likely to move and the target ring shrink slower.\n",
    "Golden Pinap Berry": "Increases the berries and candies dropped by a wild Pokémon after capture.\n",
    "Golden Razz Berry": "Increases a wild Pokémon's catch rate.\n",
    "Good Rod": "Allows the player to fish for medium-level aquatic Pokémon.\n",
    "Gooey Mulch": "Increases the number of times new Berry plants can grow where old ones withered.\n",
    "Gorgeous Box": "Sometimes held by a reward Pokémon from Pokémon Stadium if traded to Generation II.\n",
    "Gracidea": "Allows Shaymin to change form.\n",
    "Grain Cake": "Used to attract certain Pokémon.\n",
    "Gram 1": "An important letter which Wingull delivers.\n",
    "Gram 2": "An important letter which Wingull delivers.\n",
    "Gram 3": "An important letter which Wingull delivers.\n",
    "Grass Gem": "Increases the power of the holder's first Grass-type move by 50%, and is consumed after use.\n",
    "Grass Memory": "Makes Silvally a Grass-type Pokémon and makes Multi-Attack a Grass-type move.\n",
    "Grass Tera Shard": "Used to change the Tera Type of a Pokémon to Grass type.\n",
    "Grassium Z": "Allows a Pokémon to upgrade their Grass-type damaging moves to the Z-Move Bloom Doom or upgrade their Grass-type status moves into Z-Moves. Makes Arceus a Grass-type Pokémon.\n",
    "Grass Mail": "Mail with a grass pattern. To be held by a Pokémon for delivery.\n",
    "Grassy Seed": "A one-time use item that raises the holder's Defense by one stage upon activation of Grassy Terrain.\n",
    "Great Ball": "A moderately good type of Poké Ball. Only craftable in Hisui.\n",
    "Green Apricorn": "Kurt will make the player a Friend Ball out of it.Note: Formatted as Grn Apricorn prior to Generation VI.\n",
    "Green Bell Pepper": "An ingredient for sandwiches.\n",
    "Green Dish": "One of the dishes the player can use to make a sandwich on.\n",
    "Green Petal": "A green petal required to complete Mina's Trial.\n",
    "Green Poké Ball Pick": "One of the picks the player can use to make a sandwich.\n",
    "Green Scarf": "Raises the Clever condition.\n",
    "Green Shard": "Exchangeable for a variety of services.\n",
    "Greet Mail": "Stationary for introductory greetings. To be held by a Pokémon for delivery.\n",
    "Grepa Berry": "Raises friendship, but lowers Special Defense EVs.\n",
    "Grimer Candy": "Increase all stats of a member of the Grimer family by one AV point.\n",
    "Grip Claw": "Causes trapping moves (e.g. Bind, Wrap) to last for five turns.\n",
    "Grit Dust": "Raises a Pokémon's effort level for one of its stats up to level 3.\n",
    "Grit Gravel": "Raises a Pokémon's effort level for one of its stats starting at level 3 up to level 5.\n",
    "Grit Pebble": "Raises a Pokémon's effort level for one of its stats starting at level 6 up to level 8.\n",
    "Grit Rock": "Raises a Pokémon's effort level for one of its stats starting at level 9 up to level 10.\n",
    "Griseous Core": "Switches Giratina between its Altered and Origin Forme.\n",
    "Griseous Orb": "Raises the power of Giratina's Ghost- and Dragon-type moves, and causes it to take on its Origin Forme.\n",
    "Grn ID Badge": "One of four keys needed to unlock the north door of Realgam Tower.\n",
    "Groudon Treat": "Allows the player to encounter Groudon in the Terarium.\n",
    "Ground Gem": "Increases the power of the holder's first Ground-type move by 50%, and is consumed after use.\n",
    "Ground Memory": "Makes Silvally a Ground-type Pokémon and makes Multi-Attack a Ground-type move.\n",
    "Ground Tera Shard": "Used to change the Tera Type of a Pokémon to Ground type.\n",
    "Groundium Z": "Allows a Pokémon to upgrade their Ground-type damaging moves to the Z-Move Tectonic Rage or upgrade their Ground-type status moves into Z-Moves. Makes Arceus a Ground-type Pokémon.\n",
    "Growlithe Candy": "Increase all stats of a member of the Growlithe family by one AV point.\n",
    "Growth Mulch": "Causes Berries to grow faster, but makes the soil dry faster.\n",
    "Grubby Hanky": "Can be exchanged for a Fluffy Tail at Café Warehouse.\n",
    "GS Ball": "Allows Celebi to be caught in Pokémon Crystal.\n",
    "Guard Spec.": "Temporarily prevents stat reduction.\n",
    "Guidebook": "Keeps track of events and accomplishments of the player. Known as Journal prior to Pokémon Brilliant Diamond and Shining Pearl.\n",
    "Gyaradosite": "Allows Gyarados to Mega Evolve into Mega Gyarados.\n",
    "Haban Berry": "Halves the power of super effective Dragon-type moves.\n",
    "Ham": "An ingredient for sandwiches.\n",
    "Hamburger": "An ingredient for sandwiches.\n",
    "Harbor Mail": "Mail with a nautical design. To be held by a Pokémon for delivery.\n",
    "Hard Stone": "Raises the power of Rock-type moves.\n",
    "Hasty Mint": "Changes a Pokémon's Nature to Hasty.\n",
    "Heal Ball": "A type of Poké Ball that heals the captured Pokémon before it is put in the player's party. If the player's party is full, it will be transferred to the Box, where it would have been healed anyway.\n",
    "Heal Powder": "Heals any status condition, but lowers friendship.\n",
    "Health Candy": "Increase a Pokémon's HP by 1 AV until it has reached 50 AV's in the stat.\n",
    "Health Candy L": "Increase a level 30+ Pokémon's HP by 1 AV until it has reached 100 AV's in the stat.\n",
    "Health Candy XL": "Increase a level 60+ Pokémon's HP by 1 AV until it has reached 200 AV's in the stat.\n",
    "Health Feather": "Raises the HP of a Pokémon.Note: Known as Health Wing prior to Generation VIII.\n",
    "Health Mochi": "Increases a Pokémon's HP EVs by 10.\n",
    "Heart Mail": "Mail with a heart pattern. To be held by a Pokémon for delivery.\n",
    "Heart Scale": "Exchangeable for a variety of services.\n",
    "Hearthflame Mask": "Changes Ogerpon into its Hearthflame Mask form when held. It increases the power of its moves by 20%.\n",
    "Hearty Grains": "Used to craft Grain Cakes in Hisui and bait certain Pokémon.\n",
    "Heat Rock": "Extends the duration of harsh sunlight.\n",
    "Heavy Ball": "A type of Poké Ball that falls at a very short distance, but catches Pokémon who have not notices the player at a high rate.\n",
    "Heavy-Duty Boots": "The holder is unaffected by entry hazards.\n",
    "Helix Fossil": "A Fossil from which an Omanyte can be resurrected.\n",
    "Heracronite": "Allows Heracross to Mega Evolve into Mega Heracross.\n",
    "Herbed Sausage": "An ingredient for sandwiches.\n",
    "Heroic Sword Pick": "One of the picks the player can use to make a sandwich.\n",
    "Hi-tech Earbuds": "Allows the player to alter the volume of background music, sound effects and Pokémon cries.\n",
    "Hitmonchan Candy": "Increase all stats of a member of the Hitmonchan family by one AV point.\n",
    "Hitmonlee Candy": "Increase all stats of a member of the Hitmonlee family by one AV point.\n",
    "HMs": "Can be used to teach a field move to a Pokémon. HMs will not break up after use and as such can be used over and over again.\n",
    "Holo Caster": "Allows the player to view hologram clips and communicate with others.\n",
    "Hometown Muffin": "Used to complete the request \"The Taste of Home\".\n",
    "Hondew Berry": "Lowers Special Attack EV, but raises friendship.\n",
    "Honey": "Can be slathered on orange trees to attract rare Pokémon; or used in grass to attract wild Pokémon the same way Sweet Scent does.\n",
    "Honey Cake": "Used to attract certain Pokémon.\n",
    "Honor of Kalos": "Proof of defeating Team Flare and becoming Champion of the Kalos Pokémon League.\n",
    "Ho-Oh Treat": "Allows the player to encounter Ho-Oh in the Terarium.\n",
    "Hopo Berry": "Restores 10 PP of one of a Pokémon's moves. Dulls the reaction of wild Pokémon.\n",
    "Horsea Candy": "Increase all stats of a member of the Horsea family by one AV point.\n",
    "Horseradish": "An ingredient for sandwiches.\n",
    "Houndoominite": "Allows Houndoom to Mega Evolve into Mega Houndoom.\n",
    "HP Up": "Raises the HP of a Pokémon.\n",
    "Hyper Potion": "Restores 120 HP. (200HP before Gen. VII).\n",
    "Iapapa Berry": "When HP falls below 25%, restores 50% HP, but confuses Pokémon that dislike sour food (12.5% when below 50% before Gen. VII).\n",
    "Ice Berry": "Heals a burn.\n",
    "Ice Gem": "Increases the power of the holder's first Ice-type move by 50%, and is consumed after use.\n",
    "Ice Heal": "Thaws out a frozen Pokémon.\n",
    "Ice Memory": "Makes Silvally a Ice-type Pokémon and makes Multi-Attack an Ice-type move.\n",
    "Ice Stone": "Can be used to evolve Alolan Sandshrew and Alolan Vulpix.\n",
    "Ice Tera Shard": "Used to change the Tera Type of a Pokémon to Ice type.\n",
    "Iceroot Carrot": "Allows the player to summon Glastrier at the Crown Shrine.\n",
    "Icicle Plate": "Raises the power of Ice-type moves. Changes the move Judgment to Ice-type.\n",
    "Icium Z": "Allows a Pokémon to upgrade their Ice-type damaging moves to the Z-Move Subzero Slammer or upgrade their Ice-type status moves into Z-Moves. Makes Arceus an Ice-type Pokémon.\n",
    "Icy Rock": "Extends the duration of hail.\n",
    "ID Card": "Permits access to a restricted elevator at the Cipher Lab.\n",
    "Ilima's Normalium Z": "Allows a one-time rematch with the Totem Pokémon of Verdant Cavern.\n",
    "Impish Mint": "Changes a Pokémon's Nature to Impish.\n",
    "Incinium Z": "Allows Incineroar to upgrade Darkest Lariat to the special Z-Move Malicious Moonsault.\n",
    "Indigo Disk": "Gives the player more clothing and hair style options in certain stores and salons.\n",
    "Indigo Style Card": "Gives the player more clothing and hair style options in certain stores and salons.\n",
    "Inquiry Mail": "Stationary for writing questions. To be held by a Pokémon for delivery.\n",
    "Insect Plate": "Raises the power of Bug-type moves. Changes the move Judgment to Bug-type.\n",
    "Instant Noodles": "Ingredient for curry.\n",
    "Intriguing Stone": "Can be exchanged for a Sun StoneXY/PidgeotiteORAS.\n",
    "Iron": "Raises the Defense of a Pokémon.\n",
    "Iron Ball": "Cuts a Pokémon's Speed and makes it susceptible to Ground-type moves.\n",
    "Iron Barktongue": "Used to craft Aux Guard in Hisui.\n",
    "Iron Chunk": "Used to craft Poké Balls in Hisui.\n",
    "Iron Plate": "Raises the power of Steel-type moves. Changes the move Judgment to Steel-type.\n",
    "Item Drop": "Causes an ally to drop its held item. Wonder Launcher only.\n",
    "Item Urge": "Causes an ally to use its held item. Wonder Launcher only.\n",
    "Jaboca Berry": "If the foe's physical move hits, then the foe will also take damage.\n",
    "Jade Orb": "Allows the player to encounter Rayquaza in the Embedded Tower.\n",
    "Jail Key": "The key to jail cells in Pyrite Town.\n",
    "Jalapeño": "An ingredient for sandwiches.\n",
    "Jam": "An ingredient for sandwiches.\n",
    "Jaw Fossil": "A Fossil from which a Tyrunt can be resurrected.\n",
    "Jet Ball": "A type of Poké Ball that catches flying and farther away Pokémon more easily and at a greatly improved rate. Travels in a straight line when thrown.\n",
    "Jigglypuff Candy": "Increase all stats of a member of the Jigglypuff family by one AV point.\n",
    "Johto Slate": "Allows the player to fight the Legendary beasts in the Johto Room.\n",
    "Jolly Mint": "Changes a Pokémon's Nature to Jolly.\n",
    "Joy Scent": "Reduces heart gauge by a small amount, but increases friendship.\n",
    "Jubilife Muffin": "Can be used to cure a Pokémon of all non-volatile status conditions.\n",
    "Jynx Candy": "Increase all stats of a member of the Jynx family by one AV point.\n",
    "Kabuto Candy": "Increase all stats of a member of the Kabuto family by one AV point.\n",
    "Kangaskhan Candy": "Increase all stats of a member of the Kangaskhan family by one AV point.\n",
    "Kangaskhanite": "Allows Kangaskhan to Mega Evolve into Mega Kangaskhan.\n",
    "Kanto Slate": "Allows the player to fight the legendary birds in the Kanto Room.\n",
    "Kasib Berry": "Lowers effectiveness of a super effective Ghost-type move.\n",
    "Kebia Berry": "Lowers effectiveness of a super effective Poison-type move.\n",
    "Kee Berry": "Increases Defense when hit with a physical move.\n",
    "Kelpsy Berry": "Raises friendship, but lowers Attack EV.\n",
    "Ketchup": "An ingredient for sandwiches.\n",
    "Key Stone": "Allows the player to Mega Evolve their Pokémon if they hold the appropriate Mega Stone.\n",
    "Key to Room 1": "Opens Room 1 of the Abandoned ShipRSE/Sea MauvilleORAS.Note: Called Rm. 1 Key in Generation III.\n",
    "Key to Room 2": "Opens Room 2 of the Abandoned ShipRSE/Sea MauvilleORAS.Note: Called Rm. 2 Key in Generation III.\n",
    "Key to Room 4": "Opens Room 4 of the Abandoned ShipRSE/Sea MauvilleORAS.Note: Called Rm. 4 Key in Generation III.\n",
    "Key to Room 6": "Opens Room 6 of the Abandoned ShipRSE/Sea MauvilleORAS.Note: Called Rm. 6 Key in Generation III.\n",
    "King's Leaf": "Used to craft items in Hisui.\n",
    "King's Rock": "Slightly increases the chances of inflicting the Flinch condition on the opponent. Allows Slowpoke and Poliwhirl to evolve when traded.\n",
    "Kiwi": "An ingredient for sandwiches.\n",
    "Klawf Stick": "An ingredient for sandwiches.\n",
    "Koffing Candy": "Increase all stats of a member of the Koffing family by one AV point.\n",
    "Kofu's Wallet": "Given to Kofu in the Porto Marinada auction market as part of the Cascarrafa Gym Test.\n",
    "Kommonium Z": "Allows Kommo-o to upgrade Clanging Scales to the special Z-Move Clangorous Soulblaze.\n",
    "Koraidon's Poké Ball": "Allows the player to call upon Koraidon to help them in various ways.\n",
    "Krabby Candy": "Increase all stats of a member of the Krabby family by one AV point.\n",
    "Krane Memo 1": "Contains information about snagging.\n",
    "Krane Memo 2": "Contains information about the Aura Reader.\n",
    "Krane Memo 3": "Contains information about the Snag Machine.\n",
    "Krane Memo 4": "Contains information about purification.\n",
    "Krane Memo 5": "Contains information about the Purify Chamber.\n",
    "Kubfu Treat": "Allows the player to encounter Kubfu in the Terarium.\n",
    "Kuo Berry": "Cures Burn status. If transferred to Generation IV via Pal Park, it will turn into an Enigma Berry.\n",
    "Kyogre Treat": "Allows the player to encounter Kyogre in the Terarium.\n",
    "Kyurem Treat": "Allows the player to encounter Kyurem in the Terarium.\n",
    "Lagging Tail": "Causes the holder to move after the opponent.\n",
    "Lansat Berry": "Raises critical-hit ratio if HP is below ⅓ of maximum.\n",
    "Lapras Candy": "Increase all stats of a member of the Lapras family by one AV point.\n",
    "Large Leek": "Ingredient for curry.\n",
    "Latiasite": "Allows Latias to Mega Evolve into Mega Latias.\n",
    "Latias Treat": "Allows the player to encounter Latias in the Terarium.\n",
    "Latiosite": "Allows Latios to Mega Evolve into Mega Latios.\n",
    "Latios Treat": "Allows the player to encounter Latios in the Terarium.\n",
    "Lava Cookie": "Cures any status condition.\n",
    "Lax Incense": "Lowers the foe's accuracy. A Wobbuffet holding it can breed to produce a Wynaut.\n",
    "Lax Mint": "Changes a Pokémon's Nature to Lax.\n",
    "L-Disk": "Moves the UFO in The Under to the Amulet Coin.\n",
    "Leaden Ball": "A type of Poké Ball that falls at a very short distance, but catches Pokémon who have not notices the player at a higher rate.\n",
    "Leader's Crest": "Used to evolve Bisharp into Kingambit.\n",
    "Leaf Letter": "Gift from partner Pikachu.\n",
    "Leaf Stone": "Can be used to evolve Gloom into Vileplume, Weepinbell into Victreebel, Exeggcute into Exeggutor, Nuzleaf into Shiftry, and Pansage into Simisage.\n",
    "Leafy Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Leafy Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Leek": "Raises Farfetch'd's critical hit ratio.Note:Known as Stick prior to Generation VIII.\n",
    "Left Poké Ball": "Give to an NPC in exchange for a Mental Herb.\n",
    "Leftovers": "Heals a little HP at the end of each turn.\n",
    "Legend Plate": "Changes Arceus to Normal-type and changes Judgment's type based on what is most effective against the selected Pokémon's type.\n",
    "Legendary Clue 1": "Tells the player more about Calyrex.\n",
    "Legendary Clue 2": "Tells the player more about the legendary giants.\n",
    "Legendary Clue 3": "Tells the player more about the Galarian legendary birds.\n",
    "Legendary Clue?": "Tells the player more about the Ultra Wormhole.\n",
    "Lemonade": "Restores 70 HP. (80HP before Gen. VII)\n",
    "Lens Case": "Stores colored contact lenses that allow the player to change their eye color.\n",
    "Leppa Berry": "Restores 10 PP.\n",
    "Letter": "To be delivered to Steven Stone.\n",
    "Lettuce": "An ingredient for sandwiches.\n",
    "Level Ball": "A type of Poké Ball that works better on Pokémon with a lower level than the player's.\n",
    "Liberty Pass": "Gives access to Liberty Garden.\n",
    "Lickitung Candy": "Increase all stats of a member of the Lickitung family by one AV point.\n",
    "Liechi Berry": "Raises Attack when HP is below ⅓ of maximum.\n",
    "Life Orb": "Raises the power of moves, but causes recoil damage.\n",
    "Lift Key": "Allows operation of the elevator (lift) in the Team Rocket Hideout.\n",
    "Light Ball": "Raises the Attack and Special Attack of Pikachu.\n",
    "Light Clay": "Extends the duration of the moves Reflect and Light Screen.\n",
    "Light Stone": "Stone used to revive Reshiram\n",
    "Like Mail": "Stationary designed for writing recommendations. To be held by a Pokémon for delivery.\n",
    "Lilac Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Lilac Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Linking Cord": "Can be used to trigger evolution in Pokémon who would otherwise require trading to evolve.\n",
    "Litebluemail": "Mail with a Dratini pattern. To be held by a Pokémon for delivery.\n",
    "Loaded Dice": "Causes multi-strike moves to always hit at least four times.\n",
    "Lock Capsule": "Not available without cheating. Can be relocated to Black or White to obtain TM95 (Snarl).\n",
    "Lone Earring": "Can be sold for $300.\n",
    "Lonely Mint": "Changes a Pokémon's Nature to Lonely.\n",
    "Looker Ticket": "Must find five to advance the plot of the Looker post-game quest.\n",
    "Loot Sack": "Unobtainable without cheating. Original purpose was to store items found in the Underground.\n",
    "Lopunnite": "Allows Lopunny to Mega Evolve into Mega Lopunny.\n",
    "Lost Item": "Return to Copycat for access to Magnet Train.\n",
    "Lost Satchel": "The dropped items from another player or NPC. When picked up, the player is awarded Merit Points and the items are returned to the player who lost them.\n",
    "Love Ball": "A type of Poké Ball that works better on Pokémon of the opposite gender.\n",
    "Love Sweet": "When Milcery evolves holding this the Alcremie will have the Love Sweet decoration.\n",
    "Lovely Mail": "Mail with a heart design. To be held by a Pokémon for delivery.\n",
    "Lucarionite": "Allows Lucario to Mega Evolve into Mega Lucario.\n",
    "Luck Incense": "Causes earnings to double in battles against other Trainers. A Chansey or Blissey holding it can breed to produce a Happiny.\n",
    "Lucky Egg": "Doubles the experience gained during battle.\n",
    "Lucky Punch": "Raises Chansey's critical hit rate.\n",
    "Lugia Treat": "Allows the player to encounter Lugia in the Terarium.\n",
    "Lum Berry": "Cures any status condition.\n",
    "Luminous Moss": "Raises the holder's Special Defense by one stage after being hit by a Water-type attack. Consumed after use.\n",
    "Lumiose Galette": "Cures any status condition.\n",
    "Lunala Treat": "Allows the player to encounter Lunala in the Terarium.\n",
    "Lunalium Z": "Allows Lunala and Dawn Wings Necrozma to upgrade Moongeist Beam to the special Z-Move Menacing Moonraze Maelstrom.\n",
    "Lunar Feather": "Cures an endless nightmareDPPtBDSP or summon CresseliaB2W2.Note: Called Lunar Wing prior to Pokémon Brilliant Diamond and Shining Pearl.\n",
    "Lure": "Increases encounter rate of rarer wild Pokémon for 100 steps.\n",
    "Lure Ball": "A type of Poké Ball that works best on Pokémon caught using a rod.\n",
    "Lustrous Globe": "Switches Palkia between its normal form and Origin Forme.\n",
    "Lustrous Orb": "Boosts Palkia's Water- and Dragon-type attacks.\n",
    "Luxury Ball": "A Pokémon caught in a Luxury Ball will gain friendship more quickly.\n",
    "Lycanium Z": "Allows Lycanroc to upgrade Stone Edge to the special Z-Move Splintered Stormshards.\n",
    "Mach Bike": "A speedy bike that can even go up muddy slopes. It is harder to control than the Acro Bike, and cannot do tricks.\n",
    "Machine Part": "A part required for the Purify Chamber to operate properly.\n",
    "Macho Brace": "Raises Effort values but lowers Speed.\n",
    "Machop Candy": "Increase all stats of a member of the Machop family by one AV point.\n",
    "Magical Heart Pick": "One of the picks the player can use to make a sandwich.\n",
    "Magical Star Pick": "One of the picks the player can use to make a sandwich.\n",
    "Magikarp Candy": "Increase all stats of a member of the Magikarp family by one AV point.\n",
    "Magma Emblem": "Allows entrance into the Team Magma Hideout.\n",
    "Magma Stone": "Allows the player to battle Heatran.\n",
    "Magma Suit": "Allows the player to ride Groudon in the Cave of Origin and fly into space on Rayquaza.\n",
    "Magmar Candy": "Increase all stats of a member of the Magmar family by one AV point.\n",
    "Magmarizer": "A held item that allows Magmar to evolve when traded.\n",
    "Magnemite Candy": "Increase all stats of a member of the Magnemite family by one AV point.\n",
    "Magnet": "Raises the power of Electric-type moves.\n",
    "Mago Berry": "When HP falls below 25%, restores 50% HP, but confuses Pokémon that dislike spicy food (12.5% when below 50% before Gen. VII).\n",
    "Magost Berry": "Pokéblock and Poffin ingredient.\n",
    "Maingate Key": "Opens the front gate to the Shadow PKMN Lab.\n",
    "Makeup Bag": "A case for carrying lipsticks.\n",
    "Malicious Armor": "Used to evolve Charcadet into Ceruledge.\n",
    "Manectite": "Allows Manectric to Mega Evolve into Mega Manectric.\n",
    "Mankey Candy": "Increase all stats of a member of the Mankey family by one AV point.\n",
    "Maranga Berry": "Increases Special Defense when hit by a special move.\n",
    "Marble": "Can be sold for $150.\n",
    "Marill Ball": "One of the balls the player and their Pokémon can play with during a picnic.\n",
    "Mark Charm": "Increases the chances of meeting wild Pokémon with marks.\n",
    "Marmalade": "An ingredient for sandwiches.\n",
    "Marshadium Z": "Allows Marshadow to upgrade Spectral Thief to the special Z-Move Soul-Stealing 7-Star Strike.\n",
    "Marsh Balm": "Can be used to calm frenzied Hisuian Lilligant and during Azelf's trial.\n",
    "Master Ball": "A rare type of Poké Ball that catches any wild Pokémon without fail. Generally available only once in the game, though it may be obtained again in very unlikely situations (such as winning the lottery), cheating, or on the GTS in Generation IV.\n",
    "Masterpiece Teacup": "Used to evolve Artisan Form Poltchageist into Masterpiece Form Sinistcha.\n",
    "Mawilite": "Allows Mawile to Mega Evolve into Mega Mawile.\n",
    "Max Elixir": "Restores all of a Pokémon's PP.\n",
    "Max Ether": "Restores all the PP of a single move.\n",
    "Max Lure": "Increases encounter rate of rarer wild Pokémon for 250 steps.\n",
    "Max Honey": "Revives a Pokémon and restores all of its HP or can be added to Max Soup to give or remove Urshifu's Gigantamax Factor.\n",
    "Max Mushrooms": "Adds a boost to all of a Pokémons stats in a battle or can be exchanged for Max Soup.\n",
    "Max Potion": "Restores all of a Pokémon's HP.\n",
    "Max Repel": "Prevents wild Pokémon with a lower level than the first member of the party from appearing for 250 steps\n",
    "Max Revive": "Revives a Pokémon to full health.\n",
    "Mayonnaise": "An ingredient for sandwiches.\n",
    "Mayor's Note": "A letter from the Mayor to Justy.\n",
    "Meadow Plate": "Raises the power of Grass-type moves. Changes the move Judgment to Grass-type.\n",
    "Mech Mail": "Mail with a mechanical pattern. To be held by a Pokémon for delivery.\n",
    "Mechanical Box": "Once bought, it is sent to the player's home allowing Rotom to change into Heat Rotom.\n",
    "Mechanical Cabinet": "Once bought, it is sent to the player's home allowing Rotom to change into Frost Rotom.\n",
    "Mechanical Circular Saw": "Once bought, it is sent to the player's home allowing Rotom to change into Mow Rotom.\n",
    "Mechanical Pinwheel": "Once bought, it is sent to the player's home allowing Rotom to change into Fan Rotom.\n",
    "Mechanical Tub": "Once bought, it is sent to the player's home allowing Rotom to change into Wash Rotom.\n",
    "Medal Box": "A box-shaped machine that stores Medals and Medal information.\n",
    "Medichamite": "Allows Medicham to Mega Evolve into Mega Medicham.\n",
    "Medicinal Leek": "Used to craft Medicine items in Hisui.\n",
    "Mega Bracelet": "Allows the player to Mega Evolve a Pokémon holding the appropriate Mega Stone.\n",
    "Mega Ring": "Allows the player to Mega Evolve a Pokémon holding the appropriate Mega Stone.\n",
    "Meltan Candy": "Increase all stats of a member of the Meltan family by one AV point.\n",
    "Member Card": "Allows access to the Canalave City hotel to face Darkrai.\n",
    "Mental Herb": "Prevents attraction. Consumed after use.\n",
    "Meowth Candy": "Increase all stats of a member of the Meowth family by one AV point.\n",
    "Mesprit's Plume": "One of the items used to obtain the Red Chain.\n",
    "Metagrossite": "Allows Metagross to Mega Evolve into Mega Metagross.\n",
    "Metal Alloy": "Used to evolve Duraludon into Archaludon.\n",
    "Metal Coat": "Raises the power of Steel-type moves. Allows Onix and Scyther to evolve when traded.\n",
    "Metal Powder": "Raises Ditto's Defense.\n",
    "Meteorite": "Deliver to Professor CozmoRSE or Lostelle's father.FRLG Enables the Rayquaza featured in the Delta Episode to Mega Evolve.ORAS Allows the player transform Deoxys into any of its forms.SV\n",
    "Meteorite Shard": "To be delivered to Steven Stone and Professor Cozmo.\n",
    "Metronome": "Raises power of moves used in a row.\n",
    "Mew Candy": "Increase all stats of a member of the Mew family by one AV point.\n",
    "Mewnium Z": "Allows Mew to upgrade Psychic to the special Z-Move Genesis Supernova.\n",
    "Mewtwo Candy": "Increase all stats of a member of the Mewtwo family by one AV point.\n",
    "Mewtwonite X": "Allows Mewtwo to Mega Evolve into Mega Mewtwo X.\n",
    "Mewtwonite Y": "Allows Mewtwo to Mega Evolve into Mega Mewtwo Y.\n",
    "Micle Berry": "Raises a move's accuracy just once when HP is below ⅓ of maximum.\n",
    "Mighty Candy": "Increase a Pokémon's Attack by 1 AV until it has reached 50 AV's in the stat.\n",
    "Mighty Candy L": "Increase a level 30+ Pokémon's Attack by 1 AV until it has reached 100 AV's in the stat.\n",
    "Mighty Candy XL": "Increase a level 60+ Pokémon's Attack by 1 AV until it has reached 200 AV's in the stat.\n",
    "Mild Mint": "Changes a Pokémon's Nature to Mild.\n",
    "Mimikium Z": "Allows Mimikyu to upgrade Play Rough to the special Z-Move Let's Snuggle Forever.\n",
    "Mind Plate": "Raises the power of Psychic-type moves. Changes the move Judgment to Psychic-type.\n",
    "Mint Berry": "Awakens a sleeping Pokémon.\n",
    "Mint Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Mint Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "MiracleBerry": "Cures any status condition.\n",
    "Miracle Seed": "Raises the power of Grass-type moves.\n",
    "Mirage Mail": "Mail with a Mew pattern. Available only through Mystery Gift. To be held by a Pokémon for delivery.\n",
    "Miraidon's Poké Ball": "Allows the player to call upon Miraidon to help them in various ways.\n",
    "Miror Radar": "Keeps track of Miror B.\n",
    "Mirror Herb": "Copies the opponents' stat increases in battle and allows Pokémon to copy Egg Moves during a picnic.\n",
    "Misty Seed": "A one-time use item that raises the holder's Sp. Defense by one stage upon activation of Misty Terrain.\n",
    "Mixed Mushrooms": "Ingredient for curry.\n",
    "Modest Mint": "Changes a Pokémon's Nature to Modest.\n",
    "Moltres Candy": "Increase all stats of a member of the Moltres family by one AV point.\n",
    "Moltres Treat": "Allows the player to encounter Moltres in the Terarium.\n",
    "Monstrous Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Monstrous Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Moomoo Cheese": "Ingredient for curry.\n",
    "Moomoo Milk": "Restores 100 HP.\n",
    "Moon Ball": "A type of Poké Ball that works better on Pokémon that evolve using the Moon Stone.\n",
    "Moon Flute": "Used to evolve Nebby into Lunala at the Altar of the Moone.\n",
    "Moon Shard": "Allows Eevee to evolve into Umbreon in Pokémon XD: Gale of Darkness.\n",
    "Moon Stone": "Can be used to evolve Clefairy, Jigglypuff, Nidorino, Nidorina, and Skitty.\n",
    "Morph Mail": "Mail with a Ditto design. To be held by a Pokémon for delivery.\n",
    "Mosaic Mail": "Mail with a rainbow pattern. To be held by a Pokémon for delivery.\n",
    "Mountain Balm": "Can be used to calm frenzied Hisuian Electrode.\n",
    "Mr. Mime Candy": "Increase all stats of a member of the Mr. Mime family by one AV point.\n",
    "Muscle Band": "Raises the power of physical moves.\n",
    "Muscle Feather": "Raises the Attack of a Pokémon.Note: Known as Muscle Wing prior to Generation VIII.\n",
    "Muscle Mochi": "Increases a Pokémon's Attack EVs by 10.\n",
    "Mushroom Cake": "Used to attract certain Pokémon.\n",
    "Music Disc": "Allows a change of music in Trest's house.\n",
    "Music Mail": "Mail with a Natu design. Only available through Mystery Gift. To be held by a Pokémon for delivery.\n",
    "Mustard": "An ingredient for sandwiches.\n",
    "Mysterious Balm": "Can be used in the battle against Arceus, allowing the player to catch it.\n",
    "Mysterious Shard S": "Can be exchanged for Slates in Ramanas Park.\n",
    "Mysterious Shard L": "Can be exchanged for Slates in Ramanas Park.\n",
    "MysteryBerry": "Restores 5 PP.\n",
    "Mystery Egg": "Hatches into Togepi.\n",
    "Mystic Water": "Raises the power of Water-type moves.\n",
    "MysticTicket": "Allows the player to access Navel Rock and catch Lugia and Ho-Oh.\n",
    "Mythical Pecha Berry": "Used to access an event related to Pecharunt.\n",
    "Naive Mint": "Changes a Pokémon's Nature to Naive.\n",
    "Nanab Berry": "Pokéblock and Poffin ingredient.\n",
    "Naughty Mint": "Changes a Pokémon's Nature to Naughty.\n",
    "Necrozma Treat": "Allows the player to encounter Necrozma in the Terarium.\n",
    "Nest Ball": "A type of Poké Ball that works better on low-level Pokémon.\n",
    "Net Ball": "A type of Poké Ball that works better on Water- and Bug-type Pokémon.\n",
    "Never-Melt Ice": "Raises the power of Ice-type moves.Note: Formatted as NeverMeltIce prior to Generation VI.\n",
    "Nidoran♀ Candy": "Increase all stats of a member of the Nidoran♀ family by one AV point.\n",
    "Nidoran♂ Candy": "Increase all stats of a member of the Nidoran♂ family by one AV point.\n",
    "Niniku Berry": "Pokéblock ingredient. Will become an Enigma Berry if transferred to Generation IV via Pal Park.\n",
    "N-Lunarizer": "Allows Necrozma to fuse with Lunala to become Dawn Wings Necrozma.\n",
    "Nomel Berry": "Pokéblock and Poffin ingredient.\n",
    "Noodles": "An ingredient for sandwiches.\n",
    "Normal Box": "Sometimes held by reward Pokémon from clearing Gym Leader Castle in Pokémon Stadium when traded to Generation II or Pokémon Stadium 2.\n",
    "Normal Gem": "Increases the power of the holder's first Normal-type move by 50%, and is consumed after use.\n",
    "Normal Tera Shard": "Used to change the Tera Type of a Pokémon to Normal type.\n",
    "Normalium Z": "Allows a Pokémon to upgrade their Normal-type damaging moves to the Z-Move Breakneck Blitz or upgrade their Normal-type status moves into Z-Moves.\n",
    "N-Solarizer": "Allows Necrozma to fuse with Solgaleo to become Dusk Mane Necrozma.\n",
    "Nugget": "Can be sold for $5000.\n",
    "Nutpea Berry": "Pokéblock ingredient. It will become an Enigma Berry if transferred to Generation IV via Pal Park.\n",
    "Oak's Letter": "Opens the Seabreak Path and allows the user to face Shaymin.\n",
    "Oak's Parcel": "Deliver to Professor Oak to receive a Pokédex.\n",
    "Occa Berry": "Reduces damage taken from a super effective Fire-type move.\n",
    "Oceanic Slate": "Allows the player to fight Kyogre in the Oceanic Room.\n",
    "Odd Incense": "Raises the power of Psychic-type moves. Mr. Mime holding this can breed Mime Jr.\n",
    "Odd Keystone": "A stone that can trap Spiritomb.\n",
    "Oddish Candy": "Increase all stats of a member of the Oddish family by one AV point.\n",
    "Old Amber": "A Fossil from which an Aerodactyl can be resurrected.\n",
    "Old Charm": "Cynthia asks the player to deliver to Celestic Town. Is made of Pokémon bones.\n",
    "Old Gateau": "Cures any status condition.\n",
    "Old Journal": "Used in the \"Traces of a Lost Village\" request.\n",
    "Old Letter": "Delivering the letter to a man named Frank in Ballonlea earns the player a Choice Scarf.\n",
    "Old Rod": "Can be used in or next to water to initiate a battle with a low-level aquatic Pokémon.\n",
    "Old Sea Map": "Event item that gives player access to Faraway Island, where Mew can be caught.\n",
    "Old Verses": "Item that contain poetry about Hisui.\n",
    "Olive Oil": "An ingredient for sandwiches.\n",
    "Omanyte Candy": "Increase all stats of a member of the Omanyte family by one AV point.\n",
    "Onion": "An ingredient for sandwiches.\n",
    "Onix Candy": "Increase all stats of a member of the Onix family by one AV point.\n",
    "Oran Berry": "Restores 10 HP.\n",
    "Orange Dish": "One of the dishes the player can use to make a sandwich on.\n",
    "Orange Mail": "Mail with a Zigzagoon print. To be held by a Pokémon for delivery.\n",
    "Orange Petal": "An orange petal required to complete Mina's Trial.\n",
    "Origin Ball": "A type of Poké Ball that can catch Origin Forme Dialga or Origin Forme Palkia. It cannot be used to catch any other Pokémon.\n",
    "Origin Ore": "Used to craft the Origin Ball.\n",
    "Oval Charm": "An oval charm said to increase the chance of Eggs being found at the Day Care.\n",
    "Oval Stone": "When held, allows Happiny to evolve.\n",
    "Pack of Potatoes": "Ingredient for curry.\n",
    "Packaged Curry": "Ingredient for curry.\n",
    "Pair of Tickets": "Allows entry for two to the Mossdeep Space Center for the Litleonid star show.\n",
    "Pal Pad": "Used to record friends on Nintendo Wi-Fi Connection and register Friend Codes.\n",
    "Pamtre Berry": "Pokéblock and Poffin ingredient.\n",
    "Paralyze Heal": "Heals paralysis.Note: Called Parlyz Heal prior to Generation VI.\n",
    "Paras Candy": "Increase all stats of a member of the Paras family by one AV point.\n",
    "Parasol Pick": "One of the picks the player can use to make a sandwich.\n",
    "Parcel": "To be delivered to rival. Contains two Town Maps.\n",
    "Park Ball": "A type of Poké Ball that is used to recapture Generation III Pokémon in the Pal Park.\n",
    "Party Sparkler Pick": "One of the picks the player can use to make a sandwich.\n",
    "Pass": "Allows the player to ride the Magnet Train between Saffron City, Kanto; and Goldenrod City, Johto.\n",
    "Pass Orb": "Used for purchasing Pass Powers at the Entralink.\n",
    "Passho Berry": "Reduces damage from a super effective Water-type move.\n",
    "Pasta": "Ingredient for curry.\n",
    "Payapa Berry": "Reduces damage from a super effective Psychic-type move.\n",
    "Peach Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Peach Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Peanut Butter": "An ingredient for sandwiches.\n",
    "Pearl": "Can be sold for $3750.\n",
    "Pearl String": "Can be sold for $25000 to the ore collector.\n",
    "Peat Block": "Used to evolve Ursaring into Ursaluna.\n",
    "Pecha Berry": "Cures poison.\n",
    "Pep-Up Plant": "Used to craft items in Hisui.\n",
    "Pepper": "An ingredient for sandwiches.\n",
    "Permit": "A permit needed to enter the Nature Preserve. Only a few know about this place.\n",
    "Persim Berry": "Cures confusion.\n",
    "Petaya Berry": "Raises Special Attack if HP is below ⅓ of maximum.\n",
    "Pewter Crunchies": "Heal all status conditions (as well as confusion) of a single Pokémon.\n",
    "Pickle": "An ingredient for sandwiches.\n",
    "Picnic Set": "Used to set up picnics.\n",
    "Pidgeotite": "Allows Pidgeot to Mega Evolve into Mega Pidgeot.\n",
    "Pidgey Candy": "Increase all stats of a member of the Pidgey family by one AV point.\n",
    "Pika-Pika Pick": "One of the picks the player can use to make a sandwich.\n",
    "Pikachu Candy": "Increase all stats of a member of the Pikachu family by one AV point.\n",
    "Pikachu Cup": "One of the cups the player can use during a picnic.\n",
    "Pikanium Z": "Allows Pikachu to upgrade Volt Tackle to the special Z-Move Catastropika.\n",
    "Pikashunium Z": "Allows Pikachu in a cap to upgrade Thunderbolt to the special Z-Move 10,000,000 Volt Thunderbolt.\n",
    "Pinap Berry": "Pokéblock and Poffin ingredient.\n",
    "Pineapple": "An ingredient for sandwiches.\n",
    "Pink Apricorn": "Kurt will make a Love Ball out of it.Note: Formatted as Pnk Apricorn prior to Generation VI.\n",
    "Pink Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Pink Bow": "Raises the power of Normal-type moves.\n",
    "Pink Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Pink Cup": "One of the cups the player can use during a picnic.\n",
    "Pink Nectar": "Changes Oricorio to its Pa'u Style.\n",
    "Pink Petal": "A pink petal required to complete Mina's Trial.\n",
    "Pink Scarf": "Raises the Cute condition.\n",
    "Pink Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Pinsir Candy": "Increase all stats of a member of the Pinsir family by one AV point.\n",
    "Pinsirite": "Allows Pinsir to Mega Evolve into Mega Pinsir.\n",
    "Pixie Plate": "Raises the power of Fairy-type moves. Changes the move Judgment to Fairy-type.\n",
    "Plaid Chairs (B)": "One of the chair sets the player can use during a picnic.\n",
    "Plaid Chairs (R)": "One of the chair sets the player can use during a picnic.\n",
    "Plaid Chairs (Y)": "One of the chair sets the player can use during a picnic.\n",
    "Plaid Tablecloth (B)": "One of the tablecloths the player can use during a picnic.\n",
    "Plaid Tablecloth (R)": "One of the tablecloths the player can use during a picnic.\n",
    "Plaid Tablecloth (Y)": "One of the tablecloths the player can use during a picnic.\n",
    "Plasma Card": "A card key needed to enter the password inside the Plasma Frigate.\n",
    "Plume Fossil": "A Fossil from which an Archen can be resurrected.\n",
    "Plump Beans": "Used to craft Bean Cakes in Hisui and bait certain Pokémon.\n",
    "Poffin Case": "Stores Poffins.\n",
    "Point Card": "Stores Battle Points (BP) earned at the Battle Tower or Battle Frontier.\n",
    "Poison Barb": "Raises the power of Poison-type moves.\n",
    "Poison Gem": "Increases the power of the holder's first Poison-type move by 50%, and is consumed after use.\n",
    "Poison Memory": "Makes Silvally a Poison-type Pokémon and makes Multi-Attack a Poison-type move.\n",
    "Poison Tera Shard": "Used to change the Tera Type of a Pokémon to Poison type.\n",
    "Poisonium Z": "Allows a Pokémon to upgrade their Poison-type damaging moves to the Z-Move Acid Downpour or upgrade their Poison-type status moves into Z-Moves. Makes Arceus a Poison-type Pokémon.\n",
    "Poké Ball": "A ball used to catch Pokémon. Only craftable in Hisui.\n",
    "Poké Doll": "Allows the player to flee from any battle with a wild Pokémon.\n",
    "Poké Flute": "Awakens sleeping Pokémon.\n",
    "Poké Radar": "Allows player to encounter wild Pokémon not usually seen in the area. Obtained after receiving National Pokédex.\n",
    "Poké Snack": "Can be placed at Poké Spots to attract wild Pokémon.\n",
    "Poké Toy": "Allows the player to flee from any battle with a wild Pokémon.\n",
    "Pokéblock Case": "Stores Pokéblocks.\n",
    "Pokéblock Kit": "Allows the player to make and store Pokéblocks.\n",
    "Pokédex*": "Stores info about Pokémon that have been seen/caught.\n",
    "Pokédex": "Allows the player to survey Hisui and collect information about Pokémon.\n",
    "Pokémon Box Link": "Allows the Pokémon Storage System to be accessed from almost anywhere.\n",
    "Pokéshi Doll": "Can be sold for $1,000.\n",
    "Polka-Dot Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Polka-Dot Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Polka-Dot Cup": "One of the cups the player can use during a picnic.\n",
    "Polka-Dot Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Polkadot Bow": "Raises the power of Normal-type moves.\n",
    "Polished Mud Ball": "Can be sold for $600.\n",
    "Poliwag Candy": "Increase all stats of a member of the Poliwag family by one AV point.\n",
    "Pomeg Berry": "Makes a Pokémon more happy, but lowers EVs for HP.\n",
    "Ponyta Candy": "Increase all stats of a member of the Ponyta family by one AV point.\n",
    "Pop Pod": "Used to craft Scatter Bangs in Hisui.\n",
    "Portraitmail": "Mail that contains a silhouette of the Pokémon holding it. To be held by a Pokémon for delivery.\n",
    "Porygon Candy": "Increase all stats of a member of the Porygon family by one AV point.\n",
    "Potato Salad": "An ingredient for sandwiches.\n",
    "Potato Tortilla": "An ingredient for sandwiches.\n",
    "Potion": "Restores 20 HP.\n",
    "Power Anklet": "Promotes Speed EVs, but lowers Speed in battle.\n",
    "Power Band": "Promotes Special Defense EVs, but lowers Speed in battle.\n",
    "Power Belt": "Promotes Defense EVs, but lowers Speed in battle.\n",
    "Power Bracer": "Promotes Attack EVs, but lowers Speed in battle.\n",
    "Power Herb": "Allows user to skip first turn of moves that require charging.\n",
    "Power Lens": "Promotes Special Attack EVs, but lowers Speed in battle.\n",
    "Power Plant Pass": "Allows access to the Kalos Power Plant.\n",
    "Power Weight": "Promotes HP EVs, but lowers Speed in battle.\n",
    "Powerup Part": "Used to fix the Kids Grid system.\n",
    "Powder Jar": "Stores Berry Powder made from Berry Crush.\n",
    "PP Max": "Raises the PP of a move to the maximum.\n",
    "PP Up": "Raises the PP of a move.\n",
    "Precooked Burger": "Ingredient for curry.\n",
    "Premier Ball": "A Poké Ball with special coloring. The Poké Mart cashier will give one to the player for free if ten or more standard Poké Balls are purchased.\n",
    "Pretty Feather": "An item that does absolutely nothing.Note: Known as Pretty Wing prior to Generation VIII.\n",
    "Primarium Z": "Allows Primarina to upgrade Sparkling Aria to the special Z-Move Oceanic Operetta.\n",
    "Prism Scale": "A hold item that allows Feebas to evolve when traded.\n",
    "Prison Bottle": "Used to transform Hoopa Confined to Hoopa Unbound.\n",
    "Prof's Letter": "Given to the player's mother in exchange for a Town Map and a Potion.\n",
    "Professor's Mask": "Returned to Professor Kukui at Malie Garden.\n",
    "Prop Case": "Used to hold Props for the Pokémon Musical.\n",
    "Prosciutto": "An ingredient for sandwiches.\n",
    "Protective Pads": "Protects the holder from effects caused by using moves that make contact with the target.\n",
    "Protector": "A held item that allows Rhydon to evolve when traded.\n",
    "Protein": "Raises the Attack of a Pokémon.\n",
    "PRZCureBerry": "Cures paralysis.\n",
    "PSNCureBerry": "Cures poison.\n",
    "Psychic Gem": "Increases the power of the holder's first Psychic-type move by 50%, and is consumed after use.\n",
    "Psychic Memory": "Makes Silvally a Psychic-type Pokémon and makes Multi-Attack a Psychic-type move.\n",
    "Psychic Seed": "A one-time use item that raises the holder's Sp. Defense by one stage upon activation of Psychic Terrain.\n",
    "Psychic Tera Shard": "Used to change the Tera Type of a Pokémon to Psychic type.\n",
    "Psychium Z": "Allows a Pokémon to upgrade their Psychic-type damaging moves to the Z-Move Shattered Psyche or upgrade their Psychic-type status moves into Z-Moves. Makes Arceus a Psychic-type Pokémon.\n",
    "Psyduck Candy": "Increase all stats of a member of the Psyduck family by one AV point.\n",
    "Pumkin Berry": "Cures a frozen Pokémon. If transferred to Generation IV via Pal Park, it will turn into an Enigma Berry.\n",
    "Punching Glove": "Increases the power of punching moves and prevents said moves from making contact with targets.\n",
    "Pungent Root": "Ingredient for curry.\n",
    "Pure Incense": "Causes Chimecho to produce a Chingling Egg at the Pokémon Day Care. Also lowers wild Pokémon encounter rate.\n",
    "Purple Nectar": "Changes Oricorio to its Sensu Style.\n",
    "Purple Petal": "A purple petal required to complete Mina's Trial.\n",
    "Qualot Berry": "Raises friendship, but lowers Defense EVs.\n",
    "Quick Ball": "A type of Poké Ball that works better the earlier in battle it is used.\n",
    "Quick Candy": "Increase a Pokémon's Speed by 1 AV until it has reached 50 AV's in the stat.\n",
    "Quick Candy L": "Increase a level 30+ Pokémon's Speed by 1 AV until it has reached 100 AV's in the stat.\n",
    "Quick Candy XL": "Increase a level 60+ Pokémon's Speed by 1 AV until it has reached 200 AV's in the stat.\n",
    "Quick Claw": "May allow the user to move first.\n",
    "Quick Powder": "Raises Ditto's speed.\n",
    "Quiet Mint": "Changes a Pokémon's Nature to Quiet.\n",
    "Rabuta Berry": "Pokéblock and Poffin ingredient.\n",
    "Radiant Petal": "Used alongside a tuft of White Mane Hair or Black Mane Hair to create the Reins of Unity.\n",
    "Rage Candy Bar": "In most games, restores HP or heals status conditions.Note: Formatted as RageCandyBar prior to Generation VI.\n",
    "Raikou Treat": "Allows the player to encounter Raikou in the Terarium.\n",
    "Rainbow Flower": "A rainbow flower created from the Seven Petals obtained from Mina's trial, and required to finish Mina's Trial.\n",
    "Rainbow Pass": "Allows the player access to all of the Sevii Islands.\n",
    "Rainbow Slate": "Allows the player to fight Ho-Oh in the Rainbow Room.\n",
    "Rainbow Wing": "Summons Ho-Oh.\n",
    "Rare Bone": "Can be sold for $5000.\n",
    "Rare Candy": "Instantly raises a Pokémon's level by 1.\n",
    "Rash Mint": "Changes a Pokémon's Nature to Rash.\n",
    "Rattata Candy": "Increase all stats of a member of the Rattata family by one AV point.\n",
    "Rawst Berry": "Cures a burn.\n",
    "Rayquaza Treat": "Allows the player to encounter Rayquaza in the Terarium.\n",
    "Razor Claw": "Raises the chance of getting a critical hit. Allows Sneasel to evolve at night.\n",
    "Razor Fang": "Raises the chance of causing an opponent to flinch. Allows Gligar to evolve at night.\n",
    "Razz Berry": "Pokéblock and Poffin ingredient.\n",
    "R-Disk": "Moves the UFO in The Under to the Under TV Station.\n",
    "Reaper Cloth": "A held item that allows Dusclops to evolve into Dusknoir when traded.\n",
    "Recipes": "Allows the player to craft certain items using the Crafting Kit.\n",
    "Red Apricorn": "Kurt will make a Level Ball out of it.\n",
    "Red Bell Pepper": "An ingredient for sandwiches.\n",
    "Red Card": "Forces the opponent to switch to a random Pokémon when the holder is hit by a contact move. Consumed after use.\n",
    "Red Chain": "A mythical chain linked to the legendary Pokémon of the Sinnoh region. Unobtainable before Generation VIII.\n",
    "Red Dish": "One of the dishes the player can use to make a sandwich on.\n",
    "Red Flute": "Snaps a Pokémon out of attraction.RSEFRLGColoXDDPPtHGSS Can be sold for $7500.BWB2W2\n",
    "Red ID Badge": "One of four keys needed to open the front door of Realgam Tower.\n",
    "Red Nectar": "Changes Oricorio to its Baile Style.\n",
    "Red Onion": "An ingredient for sandwiches.\n",
    "Red Orb": "Awakens Groudon. It also turns Groudon into Primal Groudon during battle when holding the item.ORAS\n",
    "Red Petal": "A red petal required to complete Mina's Trial.\n",
    "Red Poké Ball Pick": "One of the picks the player can use to make a sandwich.\n",
    "Red Scale": "Give to Mr. Pokémon for an Exp. Share.\n",
    "Red Scarf": "Raises the Cool condition.\n",
    "Red Shard": "Exchangeable for a variety of services.\n",
    "Red-Flag Pick": "One of the picks the player can use to make a sandwich.\n",
    "Reins of Unity": "Used to fuse Calyrex with Glastrier or Spectrier to become Ice Rider Calyrex or Shadow Rider Calyrex.\n",
    "Relaxed Mint": "Changes a Pokémon's Nature to Relaxed.\n",
    "Relic Band": "Can be sold for $100000 to the villa owner in Undella Town.\n",
    "Relic Copper": "Can be sold for $1000 to the villa owner in Undella Town.\n",
    "Relic Crown": "Can be sold for $300000 to the villa owner in Undella Town.\n",
    "Relic Gold": "Can be sold for $10000 to the villa owner in Undella Town.\n",
    "Relic Silver": "Can be sold for $5000 to the villa owner in Undella Town.\n",
    "Relic Statue": "Can be sold for $200000 to the villa owner in Undella Town.\n",
    "Relic Vase": "Can be sold for $50000 to the villa owner in Undella Town.\n",
    "Remedy": "Heals a Pokémon by 60 HP, but lowers its friendship.\n",
    "Repeat Ball": "A type of Poké Ball that works better on Pokémon already caught before.\n",
    "Repel": "Prevents wild Pokémon with a lower level than the first member of the party from appearing for 100 steps\n",
    "Reply Mail": "Stationary for writing a reply. To be held by a Pokémon for delivery.\n",
    "Reset Urge": "Eliminates stat changes from an ally Pokémon. Wonder Launcher only.\n",
    "Reshiram Treat": "Allows the player to encounter Reshiram in the Terarium.\n",
    "Resist Feather": "Raises the Defense of a Pokémon.Note: Known as Resist Wing prior to Generation VIII.\n",
    "Resist Mochi": "Increases a Pokémon's Defense EVs by 10.\n",
    "Retro Mail": "Mail with a picture of the three Kanto first partner Pokémon.\n",
    "Reveal Glass": "A glass that tells the truth. It is a mysterious glass that returns a Pokémon back to its original shape.\n",
    "Revival Herb": "Revives a Pokémon to full HP, but lowers friendship.\n",
    "Revive": "Revives a Pokémon to half of maximum HP.\n",
    "Rhyhorn Candy": "Increase all stats of a member of the Rhyhorn family by one AV point.\n",
    "Ribbon Sweet": "When Milcery evolves holding this the Alcremie will have the Ribbon Sweet decoration.\n",
    "Rice": "An ingredient for sandwiches.\n",
    "Rich Mulch": "When applied to a Berry patch, increases the final Berry harvest by 2 Berries.\n",
    "Ride Pager": "By entering certain numbers on this pager, you can summon Ride Pokémon in an instant.\n",
    "Rindo Berry": "Reduces damage from a super effective Grass-type move.\n",
    "Ring Target": "The holder loses its type immunities.\n",
    "Rock Gem": "Increases the power of the holder's first Rock-type move by 50%, and is consumed after use.\n",
    "Rock Incense": "Raises the power of Rock-type moves. A Sudowoodo holding this can breed to produce Bonsly Eggs.\n",
    "Rock Memory": "Makes Silvally a Rock-type Pokémon and makes Multi-Attack a Rock-type move.\n",
    "Rock Tera Shard": "Used to change the Tera Type of a Pokémon to Rock type.\n",
    "Rockium Z": "Allows a Pokémon to upgrade their Rock-type damaging moves to the Z-Move Continental Crush or upgrade their Rock-type status moves into Z-Moves. Makes Arceus a Rock-type Pokémon.\n",
    "Rocky Helmet": "Any contact moves against the holder will deal 1/6 damage to the attacker.\n",
    "Roller Skates": "Allows the player to glide around and perform tricks.\n",
    "Room Service": "Lowers Speed when Trick Room is in effect.\n",
    "Root Fossil": "A Fossil from which a Lileep can be resurrected.\n",
    "Rose Incense": "Raises the power of Grass-type moves. Roselia and Roserade holding this can breed Budew.\n",
    "Roseli Berry": "Reduces damage from a super effective Fairy-type move.\n",
    "Roto-Stick": "Allows the player to take selfies from farther away.\n",
    "Roto Bargain": "Rotom Power that reduces the prices of products at Poké Marts by half.\n",
    "Roto Boost": "Rotom Power that raises all stats of your battling Pokémon.\n",
    "Roto Catch": "Rotom Power that increases the chance to catch Pokémon.\n",
    "Roto Encounter": "Rotom Power that increases the chance of encountering high-level wild Pokémon.\n",
    "Roto Exp. Points": "Rotom Power that increases the experience your Pokémon receive after a battle.\n",
    "Roto Friendship": "Rotom Power that increases the friendship of Pokémon in a players party.\n",
    "Roto Hatch": "Rotom Power that increases Egg hatching speed.\n",
    "Roto HP Restore": "Rotom Power that fully restores the HP of your battling Pokémon.\n",
    "Roto PP Restore": "Rotom Power that fully restores the PP of your battling Pokémon.\n",
    "Roto Prize Money": "Rotom Power that triples the prize money you receive after a battle.\n",
    "Roto Stealth": "Rotom Power that decreases the chance of encountering wild Pokémon.\n",
    "Rotom Bike": "Allows the player to travel faster on land. After being upgraded with Water Mode, it also allows them to ride on the water.\n",
    "Rotom Catalog": "Allows the player to change the form of a Rotom.\n",
    "Rotom Phone": "Allows the player to access multiple different functions using Rotom.\n",
    "Rowap Berry": "If a foe's special move lands, then the foe also takes damage.\n",
    "RSVP Mail": "Stationary designed for invitations. To be held by a Pokémon for delivery.\n",
    "Ruby": "Give to Celio along with Sapphire to set up the Network Machine of the Pokémon Network Center. It allows the player to trade with Ruby, Sapphire, and Emerald.\n",
    "Running Shoes*": "Allows the player to run faster.\n",
    "Rusted Shield": "Changes a Zamazenta holding this item into its Crowned Shield form.\n",
    "Rusted Sword": "Changes a Zacian holding this item into its Crowned Sword form.\n",
    "S.S. Ticket": "Allows the player to board the S.S. AnneRBYFRLGPE, S.S. AquaGSCHGSS, or S.S TidalRSEORAS\n",
    "Sablenite": "Allows Sableye to Mega Evolve into Mega Sableye.\n",
    "Sachet": "Allows Spritzee to evolve when traded.\n",
    "Sacred Ash": "Revives all fainted Pokémon in the party to full HP.\n",
    "Safari Ball": "A type of Poké Ball to be used in the Safari Zone.\n",
    "Safety Goggles": "Grants the holder immunity to weather-related damage and powder moves.\n",
    "Sail Fossil": "A Fossil from which an Amaura can be resurrected.\n",
    "Salac Berry": "Raises Speed when HP is below ⅓ of maximum.\n",
    "Salad Mix": "Ingredient for curry.\n",
    "Salamencite": "Allows Salamence to Mega Evolve into Mega Salamence.\n",
    "Salt": "An ingredient for sandwiches.\n",
    "Salt Cake": "Used to attract certain Pokémon.\n",
    "Salty Herba Mystica": "An ingredient for sandwiches.\n",
    "Sand Radish": "Used to craft Twice-Spiced Radish in Hisui.\n",
    "Sandshrew Candy": "Increase all stats of a member of the Sandshrew family by one AV point.\n",
    "Sandwich": "Used to revitalize KoraidonS/MiraidonV during the player's first encounter with it at Poco Path.\n",
    "Sapphire": "To be given to Celio along with Ruby to set up the Network Machine of the Pokémon Network Center, allowing the player to trade with Ruby, Sapphire, and Emerald.\n",
    "Sassy Mint": "Changes a Pokémon's Nature to Sassy.\n",
    "Sausages": "Ingredient for curry.\n",
    "Scanner": "To be exchanged for a Deep Sea Scale or Deep Sea Tooth.\n",
    "Scarlet Book": "Used in the Zero Lab to shut down Professor Sada's time machine.S\n",
    "Scatter Bang": "Scares off weak Pokémon.\n",
    "Sceptilite": "Allows Sceptile to Mega Evolve into Mega Sceptile.\n",
    "Scizorite": "Allows Scizor to Mega Evolve into Mega Scizor.\n",
    "Scope Lens": "Raises chances of getting a critical hit.\n",
    "Scroll of Darkness": "Used to evolve Kubfu into Urshifu (Single Strike Style).\n",
    "Scroll of Waters": "Used to evolve Kubfu into Urshifu (Rapid Strike Style).\n",
    "Scyther Candy": "Increase all stats of a member of the Scyther family by one AV point.\n",
    "Sea Incense": "Raises the power of Water-type moves. A Marill or Azumarill holding this can breed to produce Azurill Eggs.\n",
    "Seal Case": "Holds Seals.\n",
    "Secret Key": "Allows access to the secret room within the Galactic Veilstone Building.\n",
    "Secret Medicine": "Used in the request \"The Headache-Stricken Psyduck\".\n",
    "Seed of Mastery": "Can be given to Zisu to have a Pokémon master a move.\n",
    "Seel Candy": "Increase all stats of a member of the Seel family by one AV point.\n",
    "Serious Mint": "Changes a Pokémon's Nature to Serious.\n",
    "Shadow Mail": "Mail with a picture of Duskull. To be held by a Pokémon for delivery.\n",
    "Shaderoot Carrot": "Allows the player to summon Spectrier at the Crown Shrine.\n",
    "Shalour Sable": "Cures any status condition.\n",
    "Sharp Beak": "Raises the power of Flying-type moves.\n",
    "Sharpedonite": "Allows Sharpedo to Mega Evolve into Mega Sharpedo.\n",
    "Shed Shell": "Allows the holder to escape from battle.\n",
    "Shell Bell": "Restores HP to the holder based on damage inflicted to the opponent.\n",
    "Shellder Candy": "Increase all stats of a member of the Shellder family by one AV point.\n",
    "Shiny Charm": "A shiny charm said to increase the chance of finding a Shiny Pokémon.\n",
    "Shiny Leaf*": "Note: Can only be held by Pokémon and found on certain tiles in certain areas by checking the Pokémon that follows the player. No guarantee that the player can find it even in the right place.\n",
    "Shiny Stone": "Can be used to evolve Togetic, Roselia, Minccino, and Floette.\n",
    "Shoal Salt": "Can be used to make a Shell Bell. Does not have any use in Generation IV. Can be sold to an item maniac in the Icirrus City Pokémon Center for $7000 in Generation V.\n",
    "Shoal Shell": "Can be used to make a Shell Bell. Does not have any use in Generation IV. Can be sold to an item maniac in Route 5 for $7000 in Generation V.\n",
    "Shock Drive": "Makes Techno Blast an Electric-type move when held by Genesect.\n",
    "Shuca Berry": "Reduces damage taken from a super effective Ground-type move.\n",
    "Silk Scarf": "Raises the power of Normal-type moves.\n",
    "Silph Scope": "Used to identify ghosts in Pokémon Tower.\n",
    "Silver Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Silver Cup": "One of the cups the player can use during a picnic.\n",
    "Silver Leaf": "Can be sold for $500.\n",
    "Silver Nanab Berry": "Makes a wild Pokémon less likely to move and the target ring shrink slower.\n",
    "Silver Pick": "One of the picks the player can use to make a sandwich.\n",
    "Silver Pinap Berry": "Increases the berries and candies dropped by a wild Pokémon after capture.\n",
    "Silver Powder": "Raises the power of Bug-type moves.Note: Formatted as SilverPowder prior to Generation VI.\n",
    "Silver Razz Berry": "Increases a wild Pokémon's catch rate.\n",
    "Silver Wing": "Summons Lugia.\n",
    "Simple Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Sitrus Berry": "Restores 30 HP in Generation III. Restores ¼ of maximum HP from Generation IV onwards.\n",
    "Skull Fossil": "A Fossil from which a Cranidos can be resurrected.\n",
    "Sky Plate": "Raises the power of Flying-type moves. Changes the move Judgment to Flying-type.\n",
    "Sky Tumblestone": "Used to craft Feather, Wing, and Jet Balls in Hisui.\n",
    "Slowbronite": "Allows Slowbro to Mega Evolve into Mega Slowbro.\n",
    "Slowpoke Candy": "Increase all stats of a member of the Slowpoke family by one AV point.\n",
    "Slowpoke Cup": "One of the cups the player can use during a picnic.\n",
    "Slowpoke Tail": "Can be sold for $4900.Note: Formatted as SlowpokeTail prior to Generation VI.\n",
    "Small Bouquet": "Gift from partner Pokémon after entering the Hall of Fame.\n",
    "Small Tablet": "Used to activate the Relic Stone.\n",
    "Smart Candy": "Increase a Pokémon's Special Attack by 1 AV until it has reached 50 AV's in the stat.\n",
    "Smart Candy L": "Increase a level 30+ Pokémon's Special Attack by 1 AV until it has reached 100 AV's in the stat.\n",
    "Smart Candy XL": "Increase a level 60+ Pokémon's Special Attack by 1 AV until it has reached 200 AV's in the stat.\n",
    "Smiling Vee Pick": "One of the picks the player can use to make a sandwich.\n",
    "Smoke Ball": "A held item that allows the user to flee from any wild Pokémon battle. Can be used an unlimited number of times.\n",
    "Smoke Bomb": "Creates a temporary smoke cloud that hides the player.\n",
    "Smoke-Poke Tail": "Ingredient for curry.\n",
    "Smoked Fillet": "An ingredient for sandwiches.\n",
    "Smooth Rock": "Extends the duration of sandstorms.\n",
    "Snorlax Candy": "Increase all stats of a member of the Snorlax family by one AV point.\n",
    "Snorlium Z": "Allows Snorlax to upgrade Giga Impact to the special Z-Move Pulverizing Pancake.\n",
    "Snowball": "Used to stun Pokémon.\n",
    "Snow Balm": "Can be used to calm frenzied Hisuian Avalugg.\n",
    "Snow Mail": "Mail with a snow print. To be held by a Pokémon for delivery.\n",
    "Soda Pop": "Restores 50 HP. (60HP before Gen. VII).\n",
    "Soft Sand": "Raises the power of Ground-type moves.\n",
    "Solgaleo Treat": "Allows the player to encounter Solgaleo in the Terarium.\n",
    "Solganium Z": "Allows Solgaleo and Dusk Mane Necrozma to upgrade Sunsteel Strike to the special Z-Move Searing Sunraze Smash.\n",
    "Sonia's Book": "Professor Sonia's published writings.\n",
    "Soot Sack": "Allows player to gather soot from Mt. Chimney and exchange for Flutes.\n",
    "Sootfoot Root": "Used to craft Smoke Bombs in Hisui.\n",
    "Soothe Bell": "Causes the holder to gain friendship more quickly.\n",
    "Soul Dew": "Increases the power of Psychic-type and Dragon-type moves used by Latias and Latios by 20%. (Raises the Special Attack and Special Defense of Latias and Latios before Gen. VII).\n",
    "Soul Slate": "Allows the player to fight the Eon duo in the Soul Room.\n",
    "Sour Herba Mystica": "An ingredient for sandwiches.\n",
    "Space Balm": "Can be used to calm frenzied Palkia in its Origin Forme.\n",
    "Space Mail": "Mail with an outer space pattern. To be held by a Pokémon for delivery.\n",
    "Sparkling Stone": "Given to Hala to make a Z-RingSM or Z-Power RingUSUM.\n",
    "Spearow Candy": "Increase all stats of a member of the Spearow family by one AV point.\n",
    "Spectrier Treat": "Allows the player to encounter Spectrier in the Terarium.\n",
    "Spell Tag": "Raises the power of Ghost-type moves.\n",
    "Spelon Berry": "Pokéblock and Poffin ingredient.\n",
    "Spice Mix": "Ingredient for curry.\n",
    "Spicy Herba Mystica": "An ingredient for sandwiches.\n",
    "Splash Plate": "Raises the power of Water-type moves. Changes the move Judgment to Water-type.\n",
    "Spoiled Apricorn": "Used to stun Pokémon and craft Sticky Globs in Hisui.\n",
    "Spooky Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Spooky Plate": "Raises the power of Ghost-type moves. Changes the move Judgment to Ghost-type.\n",
    "Spooky Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Sport Ball": "A type of Poké Ball that is used in the Bug-Catching Contest.Note: Called Park Ball in Generation II.\n",
    "Sprayduck": "Used to water Berry plants.\n",
    "Springy Mushroom": "Used to craft Mushroom Cakes in Hisui and bait certain Pokémon.\n",
    "Sprinklotad": "Used to water Berry plants.\n",
    "Squall Slate": "Allows the player to fight Lugia in the Squall Room.\n",
    "Squirt Bottle": "Used to bring Sudowoodo out of hiding.Note: Formatted asSquirtBottle prior to Generation VI.\n",
    "Squirtle Candy": "Increase all stats of a member of the Squirtle family by one AV point.\n",
    "Stable Mulch": "Extends the time ripened Berries will stay on the plant before falling.\n",
    "Star Piece": "Can be sold for $4900.\n",
    "Star Sweet": "When Milcery evolves holding this the Alcremie will have the Star Sweet decoration.\n",
    "Stardust": "Can be sold for $1000.\n",
    "Starf Berry": "Raises a random stat when HP is below ⅓.\n",
    "Staryu Candy": "Increase all stats of a member of the Staryu family by one AV point.\n",
    "Stealth Spray": "Reduces the chance that Pokémon will notice the player.\n",
    "Steel Bottle (B)": "One of the water bottles the player can use during a picnic.\n",
    "Steel Bottle (R)": "One of the water bottles the player can use during a picnic.\n",
    "Steel Bottle (Y)": "One of the water bottles the player can use during a picnic.\n",
    "Steel Gem": "Increases the power of the holder's first Steel-type move by 50%, and is consumed after use.\n",
    "Steel Mail": "Mail with a metallic design. To be held by a Pokémon for delivery.\n",
    "Steel Memory": "Makes Silvally a Steel-type Pokémon and makes Multi-Attack a Steel-type move.\n",
    "Steel Teeth": "Give to the old man in front of Under Colosseum to obtain the L-Disk.\n",
    "Steel Tera Shard": "Used to change the Tera Type of a Pokémon to Steel type.\n",
    "Steelium Z": "Allows a Pokémon to upgrade their Steel-type damaging moves to the Z-Move Corkscrew Crash or upgrade their Steel-type status moves into Z-Moves. Makes Arceus a Steel-type Pokémon.\n",
    "Steelixite": "Allows Steelix to Mega Evolve into Mega Steelix.\n",
    "Stellar Tera Shard": "Used to change the Tera Type of a Pokémon to Stellar type.\n",
    "Sticky Barb": "Damages the holder. May latch onto the foe if a physical move is used and the foe is not already holding an item.\n",
    "Sticky Glob": "Used to stun Pokémon.\n",
    "Stone Plate": "Raises the power of Rock-type moves. Changes the move Judgment to Rock-type.\n",
    "Storage Key": "Gives the player access to the Galactic Warehouse in Veilstone City.\n",
    "Strange Ball": "A placeholder Poké Ball that displays as a Pokémon's Poké Ball if it was caught in Poké Ball that does not exist in the game.\n",
    "Strange Souvenir": "Can be sold for a low price.\n",
    "Stratospheric Slate": "Allows the player to fight Rayquaza in the Stratospheric Room.\n",
    "Strawberry": "An ingredient for sandwiches.\n",
    "Strawberry Sweet": "When Milcery evolves holding this the Alcremie will have the Strawberry Sweet decoration.\n",
    "Stretchy Spring": "Can be sold for $10.\n",
    "Strib Berry": "Pokéblock ingredient. Will become an Enigma Berry if transferred to Generation IV via Pal Park.\n",
    "Striped Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Striped Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Striped Cup": "One of the cups the player can use during a picnic.\n",
    "Striped Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Style Card": "Increases the selection in boutiques and hair salons.\n",
    "Subway Key": "Operates the subway between The Under and the Shadow PKMN Lab.\n",
    "Suicune Treat": "Allows the player to encounter Suicune in the Terarium.\n",
    "Suite Key": "Give to NPC in exchange for Lava Cookie.\n",
    "Sun Flute": "Used to evolve Nebby into Solgaleo at the Altar of the Sunne.\n",
    "Sun Shard": "Allows Eevee to evolve into Espeon.\n",
    "Sun Stone": "Can be used to evolve Sunkern, Gloom, Cottonee, Petilil, and Helioptile.\n",
    "Sunrise Flower Pick": "One of the picks the player can use to make a sandwich.\n",
    "Sunset Flower Pick": "One of the picks the player can use to make a sandwich.\n",
    "Super Lure": "Increases encounter rate of rarer wild Pokémon for 200 steps.\n",
    "Super Potion": "Restores 60 HP. (50HP before Gen. VII).\n",
    "Super Repel": "Prevents wild Pokémon with a lower level than the first member of the party from appearing for 200 steps\n",
    "Super Rod": "Can be used next to or while Surfing on water to encounter high-level wild aquatic Pokémon.\n",
    "Superb Remedy": "Heals a Pokémon by 150 HP, but lower its friendship.\n",
    "Surfboard": "An item that can be used to travel on water, much like using the hidden move Surf. Unobtainable during normal gameplay.\n",
    "Surf Mail": "Mail with a Lapras pattern. To be held by a Pokémon for delivery.\n",
    "Surge Badge": "A novelty badge that you can receive at the Kantonian Gym.\n",
    "Surprise Mulch": "When applied to a Berry patch, increases the chance of Berry mutation.\n",
    "Survival Charm B": "Increases the player's health. Is lost upon fainting.\n",
    "Survival Charm P": "Increases the player's health. Is lost upon fainting.\n",
    "Survival Charm R": "Increases the player's health. Is lost upon fainting.\n",
    "Survival Charm T": "Increases the player's health. Is lost upon fainting.\n",
    "Survival Charm Y": "Increases the player's health. Is lost upon fainting.\n",
    "Swampertite": "Allows Swampert to Mega Evolve into Mega Swampert.\n",
    "Swap Snack": "Temporarily swaps a Pokémon's offensive and defensive stats.\n",
    "Sweet Apple": "Causes Applin to evolve into Appletun upon use.\n",
    "Sweet Heart": "A very sugary chocolate. It restores one Pokémon's HP by 20.\n",
    "Sweet Herba Mystica": "An ingredient for sandwiches.\n",
    "Swift Feather": "Raises the Speed of a Pokémon.Note: Known as Swift Wing prior to Generation VIII.\n",
    "Swift Mochi": "Increases a Pokémon's Speed EVs by 10.\n",
    "Swordcap": "Used to craft Aux Power and Choice Dumplings in Hisui.\n",
    "Synchro Machine": "Allows the player to travel from the perspective of their lead party Pokémon. It only works inside the Terarium.\n",
    "Syrupy Apple": "Used to evolve Applin into Dipplin.\n",
    "System Lever": "Shuts down the Cipher Key Lair.\n",
    "Tamato Berry": "Raises friendship, but lowers Speed EVs.\n",
    "Tanga Berry": "Lowers effectiveness of a super effective Bug-type move.\n",
    "Tangela Candy": "Increase all stats of a member of the Tangela family by one AV point.\n",
    "Tapunium Z": "Allows the guardian deities to upgrade Nature's Madness to the special Z-Move Guardian of Alola.\n",
    "Tart Apple": "Causes Applin to evolve into Flapple upon use.\n",
    "Tauros Candy": "Increase all stats of a member of the Tauros family by one AV point.\n",
    "Tea": "To be given to the thirsty guards to gain entry to Saffron City.\n",
    "Teachy TV": "Gives tutorials of game functions.\n",
    "Teal Mask": "Allows Ogerpon to stay in its Teal Mask form. Used throughout the story of The Teal Mask.\n",
    "Teal Style Card": "Gives the player more clothing and hair style options in certain stores and salons.\n",
    "Tectonic Slate": "Allows the player to fight Groudon in the Tectonic Room.\n",
    "Tempting Charm B": "Prevents losing items when fainting once.\n",
    "Tempting Charm P": "Prevents losing items when fainting once.\n",
    "Tempting Charm R": "Prevents losing items when fainting once.\n",
    "Tempting Charm T": "Prevents losing items when fainting once.\n",
    "Tempting Charm Y": "Prevents losing items when fainting once.\n",
    "Tentacool Candy": "Increase all stats of a member of the Tentacool family by one AV point.\n",
    "Tera Orb": "Allow the player to Terastallize Pokémon. Must recharge after each use.\n",
    "Terrain Extender": "Lengthens duration of Electric Terrain, Psychic Terrain, Grassy Terrain, Misty Terrain, as well as Electric Surge, Psychic Surge, Grassy Surge, and Misty Surge from 5 turns to 8 turns when used by the holder.\n",
    "Terrakion Treat": "Allows the player to encounter Terrakion in the Terarium.\n",
    "Teru-sama": "A group of dummy items. Unobtainable during normal gameplay.\n",
    "Thanks Mail": "Stationary designed for a thank you note. To be held by a Pokémon for delivery.\n",
    "Thick Club": "Doubles Cubone and Marowak's Attack.\n",
    "Throat Spray": "Raises Special Attack after using a sound-based move.\n",
    "Thunder Stone": "Can be used to evolve Pikachu into Raichu, Eevee into Jolteon, and Eelektrik to Eelektross.Note: Formatted as Thunderstone prior to Generation VI.\n",
    "Tidal Bell": "Allows the Kimono Girls to summon Lugia.\n",
    "Time Balm": "Can be used to calm frenzied Dialga in its Origin Forme.\n",
    "Time Flute": "Can be used to instantly purify a Shadow Pokémon.\n",
    "Timer Ball": "A type of Poké Ball that works better the longer the battle has lasted.\n",
    "Timid Mint": "Changes a Pokémon's Nature to Timid.\n",
    "Tin of Beans": "Ingredient for curry.\n",
    "Tiny Bamboo Shoot": "Can be sold for $375.\n",
    "Tiny Mushroom": "Exchangeable in return for services.Note: Formatted as TinyMushroom prior to Generation VI.\n",
    "TMs": "One-time use items that can teach moves to Pokémon. Multi-use in Generation V - Generation VIII.\n",
    "TM Case": "Holds TMs.\n",
    "TM Materials": "Used to create TMs at the TM Machine based on what Pokémon dropped the item.\n",
    "TRs": "One-time use items that can teach moves to Pokémon.\n",
    "TMV Pass": "Allows the player to ride the TMV and access Kiloude City.\n",
    "Tofu": "An ingredient for sandwiches.\n",
    "Tomato": "An ingredient for sandwiches.\n",
    "Topo Berry": "Pokéblock ingredient. If transferred to Generation IV via Pal Park, it will turn into an Enigma Berry.\n",
    "Torn Journal": "Used in the \"Traces of a Lost Village\" request.\n",
    "Touga Berry": "Cures Confusion. If transferred to Generation IV via Pal Park, it will turn into an Enigma Berry.\n",
    "Tough Candy": "Increase a Pokémon's Defense by 1 AV until it has reached 50 AV's in the stat.\n",
    "Tough Candy L": "Increase a level 30+ Pokémon's Defense by 1 AV until it has reached 100 AV's in the stat.\n",
    "Tough Candy XL": "Increase a level 60+ Pokémon's Defense by 1 AV until it has reached 200 AV's in the stat.\n",
    "Town Map": "Contains an interactive map of the region and where the player is at the time.\n",
    "Toxic Orb": "Inflicts the Badly poisoned status on the holder.\n",
    "Toxic Plate": "Raises the power of Poison-type moves. Changes the move Judgment to Poison-type.\n",
    "Travel Trunk": "Not available without cheating. Allows the player to switch their clothes, just like in a Pokémon Center.\n",
    "Tri-Pass": "Allows the player to travel to the first three Sevii Islands.\n",
    "Tropic Mail": "Mail with a picture of Bellossom. To be held by a Pokémon for delivery.\n",
    "Tropical Shell": "Can be sold for $1,000.\n",
    "Tumblestone": "Used to craft types of Poké Balls in Hisui.\n",
    "Tunnel Mail": "Mail with a picture of a dark tunnel/mine. To be held by a Pokémon for delivery.\n",
    "Twice-Spiced Radish": "Increases the power of moves by 50%.\n",
    "Twisted Spoon": "Raises the power of Psychic-type moves.Note: Formatted as TwistedSpoon prior to Generation VI.\n",
    "Tyranitarite": "Allows Tyranitar to Mega Evolve into Mega Tyranitar.\n",
    "U-Disk": "Moves the UFO in The Under to Pyrite Town's windmill.\n",
    "Ultra Ball": "A Poké Ball with a high capture rate. Only craftable in Hisui.\n",
    "Ultranecrozium Z": "Allows Necrozma to transform into Ultra Necrozma after fusing with Solgaleo or Lunala, also upgrades Photon Geyser to the special Z-Move Light That Burns the Sky as Ultra Necrozma.\n",
    "Unown Report": "Lists the caught Unown forms. Replaces the Unown Mode of Generation II.\n",
    "Unremarkable Teacup": "Used to evolve Counterfeit Form Poltchageist into Unremarkable Form Sinistcha.\n",
    "Unusual Shoes": "Once bought, slippers are sent to the player's home.\n",
    "Upgrade": "A held item which allows Porygon to evolve when traded.Note: Formatted as Up-Grade prior to Generation VIII.\n",
    "Utility Umbrella": "Protects the holder from the effects of rain and harsh sunlight.\n",
    "Uxie's Claw": "One of the items used to obtain the Red Chain.\n",
    "Vee-Vee Pick": "One of the picks the player can use to make a sandwich.\n",
    "Venonat Candy": "Increase all stats of a member of the Venonat family by one AV point.\n",
    "Venusaurite": "Allows Venusaur to Mega Evolve into Mega Venusaur.\n",
    "Vinegar": "An ingredient for sandwiches.\n",
    "Violet Book": "Used in the Zero Lab to shut down Professor Turo's time machine.V\n",
    "Virizion Treat": "Allows the player to encounter Virizion in the Terarium.\n",
    "Vivichoke": "Used to craft items in Hisui.\n",
    "Vivid Scent": "Reduces the heart gauge by a large amount and increases friendship.\n",
    "Voice Case 1": "Heals a Combusken in Agate Village.\n",
    "Voice Case 2": "Heals a Poochyena in Agate Village.\n",
    "Voice Case 3": "Heals a Taillow in Agate Village.\n",
    "Voice Case 4": "Apparently heals a Wobbuffet in Agate Village.\n",
    "Voice Case 5": "Heals a Shroomish at ONBS.\n",
    "Volcano Balm": "Can be used to calm frenzied Hisuian Arcanine.\n",
    "Voltorb Candy": "Increase all stats of a member of the Voltorb family by one AV point.\n",
    "Vs. Recorder": "Used to record and replay battles.\n",
    "Vs. Seeker": "Used to prompt Trainers for a rematch.\n",
    "Vulpix Candy": "Increase all stats of a member of the Vulpix family by one AV point.\n",
    "Wacan Berry": "Reduces damage taken from a super effective Electric-type move.\n",
    "Wailmer Pail": "Used to water Berry plants.\n",
    "Wall Fragment": "Used to restore a wall at the Solaceon Ruins.\n",
    "Warding Charm B": "Prevents a status condition from affecting player once.\n",
    "Warding Charm P": "Prevents a status condition from affecting player once.\n",
    "Warding Charm R": "Prevents a status condition from affecting player once.\n",
    "Warding Charm T": "Prevents a status condition from affecting player once.\n",
    "Warding Charm Y": "Prevents a status condition from affecting player once.\n",
    "Wasabi": "An ingredient for sandwiches.\n",
    "Water Gem": "Increases the power of the holder's first Water-type move by 50%, and is consumed after use.\n",
    "Water Memory": "Makes Silvally a Water-type Pokémon and makes Multi-Attack a Water-type move.\n",
    "Water Stone": "Can be used to evolve Poliwhirl into Poliwrath, Shellder into Cloyster, Staryu into Starmie, Eevee into Vaporeon, Lombre into Ludicolo, and Panpour into Simipour.\n",
    "Water Tera Shard": "Used to change the Tera Type of a Pokémon to Water type.\n",
    "Watercress": "An ingredient for sandwiches.\n",
    "Waterium Z": "Allows a Pokémon to upgrade their Water-type damaging moves to the Z-Move Hydro Vortex or upgrade their Water-type status moves into Z-Moves. Makes Arceus a Water-type Pokémon.\n",
    "Watmel Berry": "Pokéblock and Poffin ingredient.\n",
    "Wave Incense": "Raises the power of Water-type moves. A Mantine holding it can breed to produce Mantyke Eggs.\n",
    "Wave Mail": "Mail with a Wailmer design. To be held by a Pokémon for delivery.\n",
    "Weakness Policy": "Attack and Sp. Atk sharply increase if the holder is hit with a super effective move.\n",
    "Weedle Candy": "Increase all stats of a member of the Weedle family by one AV point.\n",
    "Wellspring Mask": "Changes Ogerpon into its Wellspring Mask form when held. It increases the power of its moves by 20%.\n",
    "Wepear Berry": "Pokéblock and Poffin ingredient.\n",
    "Whimsical Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Whimsical Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Whipped Cream": "An ingredient for sandwiches.\n",
    "Whipped Dream": "Allows Swirlix to evolve when traded.\n",
    "White Apricorn": "If taken to Kurt, he will make the player a Fast Ball. Also, Apricorn Drink ingredient.Note: Formatted as Wht Apricorn prior to Generation VI.\n",
    "White Dish": "One of the dishes the player can use to make a sandwich on.\n",
    "White Flute": "Attracts wild Pokémon to the player.RSEFRLGDPPtHGSS Can be sold for $8000.BWB2W2 Decreases the level of wild Pokémon by one to three levels.ORAS\n",
    "White Herb": "Raises a lowered stat.\n",
    "White Mane Hair": "Used with a Radiant Petal to create the Reins of Unity.\n",
    "Wide Lens": "Boosts accuracy of holder by an 110%.\n",
    "Wiki Berry": "When HP falls below 25%, restores 50% HP, but confuses Pokémon that dislike dry food (12.5% when below 50% before Gen. VII).\n",
    "Wing Ball": "A type of Poké Ball that catches flying and farther away Pokémon more easily and at an improved rate.\n",
    "Winking Pika Pick": "One of the picks the player can use to make a sandwich.\n",
    "Wise Glasses": "Raises the power of special moves.\n",
    "Wishing Chip": "Unobtainable without cheating.\n",
    "Wishing Piece": "Can be thrown into an inactive Pokémon Den in the Wild Area in order to enable a Max Raid Battle at said Den.\n",
    "Wishing Star": "Can be fashioned to create a Dynamax Band.\n",
    "Wood": "Used to craft Pokéshi Dolls.\n",
    "Wood Mail": "Mail with picture of a Slakoth.\n",
    "Wooden Crown": "Used to summon Calyrex to Freezington.\n",
    "Works Key": "Allows player access to the Valley Windworks near Floaroma Town.\n",
    "X Accuracy": "Raises a Pokémon's Accuracy by 2 stages (1 stage before Gen. VII).\n",
    "X Accuracy 2": "Sharply raises a Pokémon's accuracy. Wonder Launcher only.\n",
    "X Accuracy 3": "Drastically raises a Pokémon's accuracy. Wonder Launcher only.\n",
    "X Accuracy 6": "Immensely raises a Pokémon's accuracy. Wonder Launcher only.\n",
    "X Attack": "Raises a Pokémon's Attack by 2 stages (1 stage before Gen. VII).\n",
    "X Attack 2": "Sharply raises a Pokémon's Attack. Wonder Launcher only.\n",
    "X Attack 3": "Drastically raises a Pokémon's Attack. Wonder Launcher only.\n",
    "X Attack 6": "Immensely raises a Pokémon's Attack. Wonder Launcher only.\n",
    "X Defense": "Raises a Pokémon's Defense by 2 stages (1 stage before Gen. VII).Note: Called X Defend prior to Generation VI.\n",
    "X Defense 2": "Sharply raises a Pokémon's Defense. Wonder Launcher only.Note: Called X Defend 2 prior to Generation VI.\n",
    "X Defense 3": "Drastically raises a Pokémon's Defense. Wonder Launcher only.Note: Called X Defend 3 prior to Generation VI.\n",
    "X Defense 6": "Immensely raises a Pokémon's Defense. Wonder Launcher only.Note: Called X Defend 6 prior to Generation VI.\n",
    "X Sp. Atk": "Raises a Pokémon's Special Attack (Special in Generation I) by 2 stages (1 stage before Gen. VII).Note: Called X Special prior to Generation VI.\n",
    "X Sp. Atk 2": "Sharply raises a Pokémon's Special Attack. Wonder Launcher only.Note: Called X Special 2 prior to Generation VI.\n",
    "X Sp. Atk 3": "Drastically raises a Pokémon's Special Attack. Wonder Launcher only.Note: Called X Special 3 prior to Generation VI.\n",
    "X Sp. Atk 6": "Immensely raises a Pokémon's Special Attack. Wonder Launcher only.Note: Called X Special 6 prior to Generation VI.\n",
    "X Sp. Def": "Raises a Pokémon's Special Defense by 2 stages (1 stage before Gen. VII).\n",
    "X Sp. Def 2": "Sharply raises a Pokémon's Special Defense. Wonder Launcher only.\n",
    "X Sp. Def 3": "Drastically raises a Pokémon's Special Defense. Wonder Launcher only.\n",
    "X Sp. Def 6": "Immensely raises a Pokémon's Special Defense. Wonder Launcher only.\n",
    "X Speed": "Raises a Pokémon's Speed by 2 stages (1 stage before Gen. VII).\n",
    "X Speed 2": "Sharply raises a Pokémon's Speed. Wonder Launcher only.\n",
    "X Speed 3": "Drastically raises a Pokémon's Speed. Wonder Launcher only.\n",
    "X Speed 6": "Immensely raises a Pokémon's Speed. Wonder Launcher only.\n",
    "Xtransceiver": "Used to make video calls to other players. Also used by in-game Trainers to advance the story.\n",
    "Yache Berry": "Reduces damage taken from a super effective Ice-type move.\n",
    "Yago Berry": "Pokéblock ingredient. Will turn into an Enigma Berry if transferred to Generation IV via Pal Park.\n",
    "Yarn Ball": "One of the balls the player and their Pokémon can play with during a picnic.\n",
    "Yellow Apricorn": "If taken to Kurt, he will make the player a Moon Ball out of it.Note: Formatted as Ylw Apricorn prior to Generation VI.\n",
    "Yellow Bell Pepper": "An ingredient for sandwiches.\n",
    "Yellow Bottle": "One of the water bottles the player can use during a picnic.\n",
    "Yellow Chairs": "One of the chair sets the player can use during a picnic.\n",
    "Yellow Cup": "One of the cups the player can use during a picnic.\n",
    "Yellow Dish": "One of the dishes the player can use to make a sandwich on.\n",
    "Yellow Flute": "Snaps a Pokémon out of Confusion.RSEFRLGColoXDDPPtHGSSORAS Can be sold for $7500.BWB2W2\n",
    "Yellow Nectar": "Changes Oricorio to its Pom-Pom Style.\n",
    "Yellow Petal": "A yellow petal required to complete Mina's Trial.\n",
    "Yellow Scarf": "Raises the Tough condition.\n",
    "Yellow Shard": "Exchangeable for a variety of services.\n",
    "Yellow Tablecloth": "One of the tablecloths the player can use during a picnic.\n",
    "Ylw ID Badge": "One of four keys needed to unlock the north door of Realgam Tower.\n",
    "Yogurt": "An ingredient for sandwiches.\n",
    "Zap Plate": "Raises the power of Electric-type moves. Changes the move Judgment to Electric-type.\n",
    "Zapdos Candy": "Increase all stats of a member of the Zapdos family by one AV point.\n",
    "Zapdos Treat": "Allows the player to encounter Zapdos in the Terarium.\n",
    "Zekrom Treat": "Allows the player to encounter Zekrom in the Terarium.\n",
    "Zinc": "Raises the Special Defense of a Pokémon.\n",
    "Zoom Lens": "A Pokémon held item. If the holder moves after its target moves, its Accuracy will be boosted.\n",
    "Z-Power Ring": "Allows the player to use Z-Moves when a Pokémon is holding an appropriate Z-Crystal. Allows the player to use Mega Evolution after obtaining a Key Stone when a Pokémon is holding the appropriate Mega Stone.\n",
    "Z-Ring": "Allows the player to use Z-Moves when a Pokémon is holding an appropriate Z-Crystal. Allows the player to use Mega Evolution after obtaining a Key Stone when a Pokémon is holding the appropriate Mega Stone.\n",
    "Zubat Candy": "Increase all stats of a member of the Zubat family by one AV point.\n",
    "Zygarde Cube": "Holds collected Zygarde Cores and Cells and teaches Zygarde moves.\n"
}